[
{
    "title": "Moroccan vegetables with couscous",
    "description": "Aubergines are wonderful roasted, serve with couscous and topped with chickpeas to make this flavourful vegetarian dish. With a GI of 43 this meal is high protein, low GI and provides 202 kcal per portion.",
    "cuisine": "african",
    "courses": [],
    "diets": [],
    "image": "images/moroccan_vegetables_with_52330_16x9.jpg",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/moroccan_vegetables_with_52330",
    "chefName": "Justine Pattison",
    "preparationTime": "less than 30 mins",
    "cookingTime": "30 mins to 1 hour",
    "serves": "Serves 4",
    "ingredientsDesc": [
        "2 small aubergines",
        "calorie controlled cooking oil spray",
        "½ medium onion, finely chopped",
        "½ tsp ground cumin",
        "½ tsp ground coriander",
        "¼ tsp hot chilli powder",
        "pinch ground cinnamon",
        "227g/8oz tin chopped tomatoes",
        "½ red pepper, deseeded and diced",
        "1 medium courgette, cut into 1.5cm/½in chunks",
        "400g/14oz tin chickpeas, drained and rinsed",
        "2 heaped tbsp roughly chopped fresh coriander, plus extra to garnish",
        "400ml/14fl oz vegetable stock, made with ½ stock cube",
        "½ small lemon, juice only",
        "15g/½oz roughly chopped pistachio nuts (alternatively use toasted flaked almonds)",
        "100g/3½oz  fat-free natural yoghurt, to serve",
        "½ vegetable stock cube",
        "80g/2¾oz wholegrain couscous",
        "½ small lemon, finely grated zest only",
        "2 heaped tbsp roughly chopped fresh coriander",
        "freshly ground black pepper"
    ],
    "ingredients": [
        "coriander",
        "pepper",
        "oil",
        "lemon",
        "onion",
        "aubergines",
        "fresh coriander",
        "cumin",
        "black pepper",
        "pistachio",
        "chopped tomatoes",
        "chickpeas",
        "cinnamon",
        "couscous",
        "vegetable stock",
        "yoghurt",
        "courgette",
        "chilli powder"
    ],
    "method": [
        "Preheat the oven to 200C/180C Fan/Gas 6.",
        "Cut the aubergines in half from top to bottom and score in a criss-cross pattern through the flesh. Place on a small baking tray and spray with oil. Season with a little black pepper and bake for 30-40 minutes or until very tender and lightly browned.",
        "Meanwhile, spray a large non-stick frying pan with oil and place over a medium heat. Add the onion and cook for five minutes, stirring regularly until softened and lightly browned. Add the cumin, coriander, chilli and cinnamon and cook for a few seconds, stirring constantly.",
        "Pour the tomatoes into the pan. Add the pepper, courgette, chickpeas, coriander and stock. Season with a little salt and lots of ground black pepper and bring to a gentle simmer. Cook for around 20 minutes, stirring occasionally until the vegetables are tender and the sauce is thick.",
        "Just before the sauce is ready, make the couscous. Dissolve the stock cube in 100ml/3½fl oz just-boiled water in a medium bowl.  Stir in the couscous, cover and rest for three minutes. Add the lemon zest, coriander and season to taste. Toss well together, using a fork to break up the clumps of couscous.",
        "Divide the aubergines between two plates. Stir the lemon juice into the chickpeas and season to taste. Spoon the spiced chickpeas over the aubergines. Add the couscous and sprinkle with chopped nuts. Garnish with coriander and yoghurt."
    ]
},
{
    "title": "Goat stew with cabbage and peanut butter",
    "description": "",
    "cuisine": "african",
    "courses": [],
    "diets": [],
    "image": "",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/sadzagoatstewwithcab_89103",
    "chefName": "Thandie Newton",
    "preparationTime": "30 mins to 1 hour",
    "cookingTime": "over 2 hours",
    "serves": "Serves 4",
    "ingredientsDesc": [
        "1kg/2lb 5½oz goat meat cut into 2.5cm/1in pieces",
        "salt and freshly ground black pepper",
        "3 tbsp vegetable oil",
        "25g/1oz butter",
        "1 large onion, finely chopped",
        "2 garlic cloves, chopped",
        "4 carrots, finely chopped",
        "2 tsp tomato purée",
        "¼ tsp cloves",
        "¼ tsp ginger powder",
        "pinch cayenne pepper",
        "2 tbsp lemon juice",
        "450ml/15fl oz lamb or beef stock",
        "2-3 sprigs fresh thyme",
        "1 bay leaf",
        "salt and freshly ground black pepper",
        "1 medium cabbage, shredded",
        "salt",
        "3-4 tbsp (or to taste) peanut butter",
        "200g/7oz millet, cooked according to packet instructions"
    ],
    "ingredients": [
        "vegetable oil",
        "butter",
        "bay leaf",
        "beef stock",
        "onion",
        "salt",
        "carrots",
        "thyme",
        "ginger",
        "cayenne pepper",
        "lemon juice",
        "black pepper",
        "garlic",
        "1kg/2lb 5½oz goat meat cut into 2.5cm/1in pieces",
        "cabbage",
        "millet",
        "cloves",
        "tomato purée",
        "peanut butter"
    ],
    "method": [
        "Season the goat meat with salt and freshly ground black pepper. Heat the oil and butter in a deep, heavy-based pan. Add the goat meat and fry, stirring occasionally, until browned all over.",
        "Add the onions and garlic and fry over a medium heat until the onions are translucent.",
        "Add the tomato purée, cloves, ginger and cayenne pepper and fry for one minute, stirring constantly.",
        "Add the lemon juice, lamb or beef stock, thyme and bay leaf and bring to the boil. Reduce the heat, cover with a lid and simmer for 1½-2 hours, or until the meat is tender.",
        "For the cabbage, place the cabbage into a bowl and cover with cold salted water for half an hour.",
        "Drain off all but a few tablespoons of the cabbage soaking water and transfer the cabbage to a pan over a medium heat. Cover with a lid and steam the cabbage until tender.",
        "Drain the cabbage, then return to the pan. Add the peanut butter and stir into the cabbage.",
        "To serve, place the cabbage and the goat stew into separate serving bowls. Serve with millet - roll the millet into a ball in your hand and dip into the goat stew."
    ]
},
{
    "title": "Marinated minty lamb kebabs",
    "description": "Lamb and mint is a classic combination. Cook on skewers with pepper and onion to add crunch and serve with couscous for a healthy evening meal.This meal is low calorie and provides 421 kcal, 27g protein, 57g carbohydrate (of which 7.5g sugars), 9g fat (of which 3.5g saturates), 1.5g fibre and 0.3g salt per portion.",
    "cuisine": "african",
    "courses": [],
    "diets": [],
    "image": "images/marinated_minty_lamb_61532_16x9.jpg",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/marinated_minty_lamb_61532",
    "chefName": "",
    "preparationTime": "less than 30 mins",
    "cookingTime": "10 to 30 mins",
    "serves": "Serves 4",
    "ingredientsDesc": [
        "1 garlic clove, crushed",
        "2 tbsp chopped mint",
        "1 tbsp ready-made mint sauce",
        "150g/5Â˝oz low-fat natural yoghurt",
        "375g/13oz lean lamb, cubed",
        "400g/14oz wholegrain couscous",
        "2 small onions, cut into wedges",
        "1 green pepper, cored, deseeded and cut into wedges",
        "lemon wedges, to serve",
        "salt and freshly ground black pepper"
    ],
    "ingredients": [
        "lamb",
        "pepper",
        "mint sauce",
        "lemon",
        "onions",
        "black pepper",
        "garlic",
        "couscous",
        "yoghurt",
        "mint"
    ],
    "method": [
        "Mix together the garlic, mint, mint sauce and yoghurt in a bowl, add the lamb and stir well. Cover and leave to marinate in a cool place for 10 minutes.",
        "Meanwhile, place the couscous in a heatproof bowl, pour 500ml/18fl oz of boiling water over the couscous. Leave to stand until the liquid has been absorbed. Season with salt and pepper and fluff the couscous with a fork. Set aside.",
        "Preheat the grill to a hot setting.",
        "Thread the lamb and onion and pepper wedges on to 8 metal skewers and cook under the grill for 8-10 minutes, or until cooked through.",
        "Serve the kebabs with lemon wedges and the couscous."
    ]
},
{
    "title": "Bunny chow",
    "description": "People from Durban are very proud of their Bunny Chow and its heritage - a cheap curry from the depression era. The version here is made with meat, but you can substitute with red and white kidney beans.",
    "cuisine": "african",
    "courses": [],
    "diets": [],
    "image": "images/bunny_chow_38916_16x9.jpg",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/bunny_chow_38916",
    "chefName": "Atul Kochhar",
    "preparationTime": "less than 30 mins",
    "cookingTime": "1 to 2 hours",
    "serves": "Serves 4",
    "ingredientsDesc": [
        "2 tbsp vegetable oil",
        "½ tsp cumin seeds",
        "½ tsp fennel seeds",
        "2.5cm/1in piece of cinnamon stick",
        "2 green cardamom pods",
        "1 star anise",
        "1 bay leaf",
        "1 onion, finely chopped",
        "2 tbsp South African curry powder",
        "2 tomatoes, chopped",
        "1kg/2lb 2oz boneless leg of lamb, cut into 1.5cm/½in dices",
        "1 tbsp finely chopped fresh ginger",
        "1 tbsp finely chopped garlic",
        "10-12 curry leaves",
        "2 large potatoes, cut in cubes the same size as the meat",
        "salt",
        "2 tbsp finely chopped coriander leaves",
        "2 tbsp lime juice",
        "2 loaves of crusty white bread, unsliced, each cut across in half in the middle and most of the crumbs removed",
        "coriander cress or sprigs, to garnish"
    ],
    "ingredients": [
        "vegetable oil",
        "coriander",
        "star anise",
        "leg of lamb",
        "onion",
        "lime juice",
        "cardamom",
        "potatoes",
        "coriander cress",
        "cumin",
        "fennel seeds",
        "ginger",
        "garlic",
        "cinnamon",
        "curry powder",
        "bay leaf",
        "white bread",
        "curry leaves",
        "salt",
        "tomatoes"
    ],
    "method": [
        "Heat the oil in a pan and sauté the whole spices and bay leaf until the spices sizzle.",
        "Add the onion and cook for 5–7 minutes until translucent.",
        "Stir in the curry powder and sauté for one minute, then add the tomatoes and stir to mix.",
        "Cook on medium heat, stirring often, until you get a sauce-like consistency.",
        "Add the meat, ginger, garlic and curry leaves and 300ml/11fl oz water, bring to the boil then reduce the heat and simmer, stirring occasionally, for 40-50 minutes or until the meat is tender.",
        "Add the potatoes, salt to taste and 200ml/7fl oz water. Continue simmering until the meat and potatoes are perfectly cooked (about 15 minutes).",
        "Stir in the chopped coriander and lime juice.",
        "To serve, spoon into the hollows in the bread and garnish with coriander cress."
    ]
},
{
    "title": "Jollof rice with fried plantains",
    "description": "Jollof rice is found throughout West Africa and is thought to be the origin of the Cajun dish, jambalaya. Serve with fried plantains and a crisp green salad.",
    "cuisine": "african",
    "courses": [],
    "diets": [],
    "image": "images/jollof_rice_with_fried_79619_16x9.jpg",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/jollof_rice_with_fried_79619",
    "chefName": "African women's group",
    "preparationTime": "less than 30 mins",
    "cookingTime": "1 to 2 hours",
    "serves": "Serves 4",
    "ingredientsDesc": [
        "1 tbsp olive or vegetable oil",
        "2 large onions, sliced",
        "2 x 400g/14oz cans plum tomatoes",
        "1 red pepper, diced",
        "4 tbsp tomato purée",
        "¼ tsp cayenne pepper or chilli powder",
        "1 tsp curry powder",
        "1 bay leaf",
        "sprig fresh thyme",
        "1 stock cube",
        "225g/8oz long-grain or basmati rice",
        "salt and freshly ground black pepper",
        "2 plantains, cut into slices and deep fried",
        "green leaf salad"
    ],
    "ingredients": [
        "vegetable oil",
        "green leaf salad",
        "pepper",
        "bay leaf",
        "thyme",
        "plantains",
        "cayenne pepper",
        "black pepper",
        "curry powder",
        "rice",
        "onions",
        "tomato purée",
        "tomatoes",
        "stock"
    ],
    "method": [
        "For the rice, heat the oil in a large pan and cook the onions over a gentle heat until translucent.",
        "Stir in the canned tomatoes, red pepper and tomato purée, then season with salt, freshly ground black pepper and the cayenne or chilli. Add the curry powder, bay leaf and thyme, then pour in 550ml/19fl oz of water and crumble in the stock cube.",
        "Cover and bring to the boil, then reduce the heat and simmer for 20–30 minutes.",
        "Rinse the rice well to remove excess starch, then add it to the tomato mixture.",
        "Bring to the boil, then reduce the heat to low. Cover and simmer for 25–30 minutes, or until the rice is cooked.",
        "Season to taste with salt and freshly ground black pepper and serve the joffol with fried plantains and a crisp green salad."
    ]
},
{
    "title": "Vegetable chilli with peanut butter cabbage and sadza",
    "description": "Sadza is Zimbabwe’s staple dish, traditionally made with white cornmeal. Polenta is just another name for cornmeal and could easily be substituted here. The vegetable chilli is just as good served cold.",
    "cuisine": "african",
    "courses": [],
    "diets": [],
    "image": "",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/manyatis_vegetable_35397",
    "chefName": "Zimwomen Association",
    "preparationTime": "less than 30 mins",
    "cookingTime": "30 mins to 1 hour",
    "serves": "Serves 4",
    "ingredientsDesc": [
        "3 tbsp olive oil",
        "1 small onion, chopped",
        "2 carrots, diced",
        "½ red pepper, seeds removed and chopped",
        "½ yellow pepper, seeds removed and chopped",
        "½ green pepper, seeds removed and chopped",
        "100g/3½oz green beans, chopped",
        "2 tomatoes, chopped",
        "3–4 chillies, seeds removed and flesh chopped",
        "salt and freshly ground black pepper",
        "375g/13oz white cornmeal (mealie meal)",
        "½ small cabbage (or any seasonally vegetable), shredded",
        "1 small onion, chopped",
        "1 tomato, chopped",
        "4 tbsp peanut butter"
    ],
    "ingredients": [
        "olive oil",
        "tomato",
        "pepper",
        "chillies",
        "onion",
        "carrots",
        "salt and freshly ground black pepper",
        "green beans",
        "peanut butter",
        "cabbage",
        "tomatoes",
        "375g/13oz white cornmeal (mealie meal)"
    ],
    "method": [
        "For the chilli, heat the oil in a large pan and gently fry the onion until soft but not brown.",
        "Add the carrots, peppers and green beans, fry briefly then add the tomatoes, and chillies and simmer the stew until the vegetables are tender. Season to taste with salt and freshly ground black pepper.",
        "For the sadza, mix 225g/8oz of the cornmeal with 250ml/9fl oz of water.",
        "Bring 750ml/1¼ pints of water to the boil in a pan, then turn down the heat and add the cornmeal mixture, stirring all the time. Cook for five minutes, then gradually add the remaining cornmeal. Transfer to a bowl or plate and flatten into a round shape with a wooden spoon.",
        "For the peanut butter cabbage, pour about 125ml/4fl oz of water into a pan and bring to the boil. Add the cabbage and cook until slightly softened but still crunchy.",
        "Add the onion and tomato then stir in the peanut butter, adding more water if the mixture seems too thick. Season with salt and freshly ground black pepper. Serve with the sadza and vegetable chilli."
    ]
},
{
    "title": "Zoe’s jollof ",
    "description": "This filling, flavoursome chicken and rice dish is a West-African speciality. Fried plantains make an authentic garnish.",
    "cuisine": "african",
    "courses": [],
    "diets": [],
    "image": "",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/zoes_jollof_43216",
    "chefName": "Zoe Adjonyah",
    "preparationTime": "less than 30 mins",
    "cookingTime": "30 mins to 1 hour",
    "serves": "Serves 6",
    "ingredientsDesc": [
        "8 bone-in chicken thighs or drumsticks",
        "1 large onion, roughly chopped",
        "1 Scotch bonnet chilli, de-seeded, finely chopped",
        "1 tbsp fresh or dried thyme leaves",
        "2 tbsp crayfish powder (available from online specialists)",
        "6 Guinea peppers (also known as grains of paradise), crushed",
        "6 large tomatoes, roughly chopped",
        "200g/7oz tomato purée",
        "1 tsp salt",
        "4 tbsp peanut oil or sunflower oil",
        "1 large onion, finely chopped",
        "2 garlic cloves, crushed",
        "1 tsp ground hot chilli powder",
        "300g/10½oz long-grain white rice, washed and drained",
        "handful chopped fresh parsley and coriander, to garnish"
    ],
    "ingredients": [
        "coriander",
        "rice",
        "onion",
        "thyme",
        "2 tbsp crayfish powder (available from online specialists)",
        "6 Guinea peppers (also known as grains of paradise), crushed",
        "chicken thighs",
        "garlic",
        "sunflower oil",
        "chilli powder",
        "salt",
        "tomato purée",
        "tomatoes",
        "Scotch bonnet chilli"
    ],
    "method": [
        "Preheat the oven to 180C/160C fan/Gas 4.",
        "For the broth, heat a deep-sided, heavy-based casserole or saucepan over a low heat. Add all of the broth ingredients, then pour in just enough water to cover them and bring to the boil. Reduce the heat until the mixture is simmering, then simmer for 18-20 minutes, or until the chicken is tender and cooked through. (The chicken is cooked through if the juices run clear when a skewer is inserted into the thickest part and no traces of pink remain.)",
        "Remove the cooked chicken from the casserole and transfer to a baking tray. Cover with aluminium foil and keep warm.",
        "Strain the broth, collecting the strained liquid in a large jug. Set aside and keep warm.",
        "For the tomato sauce, blend the chopped tomatoes, tomato purée and salt to a smooth purée in a food processor. Set aside.",
        "For the jollof sauce, heat the oil in a lidded saucepan over a medium heat. Add the onion and fry for 4-5 minutes, or until softened.",
        "Add the garlic and chilli powder and continue to fry for a further 4-5 minutes, stirring well. Stir in the tomato sauce and the reserved broth until well combined.",
        "Add the rice and stir to coat it in the sauce. Reduce the heat until the mixture is just simmering, cover the pan with a sheet of aluminium foil, then place the lid on top. Simmer for 30 minutes, or until the rice is tender and has absorbed all the liquid.",
        "Halfway through cooking the jollof rice, finish the chicken. Remove the foil from the chicken and roast in the oven for 15 minutes, or until browned and sticky.",
        "Serve the jollof rice with the chicken, garnished with a sprinkling of chopped parsley and coriander."
    ]
},
{
    "title": "Cafriela de Frango from Guinea-Bissau",
    "description": "This West African dish cooks marinated chicken pieces on the hob before grilling them to brown. And it’s loaded with flavour from garlic, onions and chillies.",
    "cuisine": "african",
    "courses": [],
    "diets": [],
    "image": "",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/cafriela_de_frango_from_69579",
    "chefName": "Abdon Manga",
    "preparationTime": "less than 30 mins",
    "cookingTime": "30 mins to 1 hour",
    "serves": "Serves 6-8",
    "ingredientsDesc": [
        "2 medium chickens, jointed",
        "2 tsp salt",
        "10 hot chilies, sliced",
        "5 cloves garlic, crushed",
        "200g/7oz onion, sliced",
        "3 lemons, juice only",
        "salt",
        "1 tbsp vegetable oil"
    ],
    "ingredients": [
        "vegetable oil",
        "10 hot chilies, sliced",
        "onion",
        "chickens",
        "garlic",
        "lemons",
        "salt"
    ],
    "method": [
        "Season the chicken pieces with salt and marinate in a bowl with the garlic, chilies, half the sliced onions and lemon juice. After a few hours in the fridge, add the oil and transfer the mix to a large saucepan or stew pot.",
        "Add a small cup of water and cook over a medium heat, covered, for 30 minutes, until the chicken is cooked through, adding a little more water if it is drying out. Strain and reserve the excess liquid, and finish the chicken by grilling it for 15 minutes or so on a barbecue or in the oven.",
        "In the meantime, return the liquid to the stove and reduce, adding a little oil and the rest of the finely sliced onions. Cook over a medium heat for twenty minutes, adding more lemon juice and chilies if you like. When the chicken is well-browned, place it onto a serving plate and pour the sauce over it."
    ]
},
{
    "title": "Moroccan baked eggs",
    "description": "Baked eggs are the perfect dish for a lazy brunch. If you like your eggs spicy just add a little chilli powder.As part of an Intermittent diet plan, 1 serving provides 2 of your 6 daily vegetable portions.This meal provides 170 kcal per portion. If eating it as part of a daily Intermittent diet menu, also enjoy 200ml skimmed milk (70 calories).",
    "cuisine": "african",
    "courses": [],
    "diets": [],
    "image": "images/moroccan_baked_eggs_12048_16x9.jpg",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/moroccan_baked_eggs_12048",
    "chefName": "",
    "preparationTime": "less than 30 mins",
    "cookingTime": "10 to 30 mins",
    "serves": "Serves 2",
    "ingredientsDesc": [
        "½ tbsp olive oil",
        "½ onion, chopped",
        "1 garlic clove, sliced",
        "½ tsp ras-el-hanout",
        "pinch ground cinnamon",
        "½ tsp ground coriander",
        "400g/14oz cherry tomatoes, chopped",
        "2 tbsp chopped coriander",
        "2 free-range eggs",
        "salt and freshly ground black pepper"
    ],
    "ingredients": [
        "olive oil",
        "coriander",
        "onion",
        "ras-el-hanout",
        "eggs",
        "black pepper",
        "garlic",
        "cinnamon",
        "cherry tomatoes"
    ],
    "method": [
        "Preheat the oven to 220C/200C Fan/Gas 7.",
        "Heat the oil in a frying pan, add the onion and garlic and cook for 6-7 minutes, or until soft. Stir in the spices and cook, stirring, for a further minute.",
        "Add the tomatoes and season well with salt and pepper, then simmer gently for 8-10 minutes.",
        "Scatter over 1 tablespoon of the coriander, then divide the tomato mixture between 2 individual ovenproof dishes. Break an egg into each dish.",
        "Bake for 8-10 minutes until the egg whites are set but the yolks are still slightly runny. Cook for a further 2-3 minutes if you prefer the eggs to be cooked through.",
        "Scatter over the remaining coriander and serve."
    ]
},
{
    "title": "Lamb with hummus and tortillas",
    "description": "Homemade hummus is easy to make and tastes great. It is perfect for wraps and can be kept in the fridge for up to three days.For this recipe you will need a blender or food processor to make the hummus.This meal is low calorie and provides 523 kcal, 37.6g protein, 52.2g carbohydrate (of which 8.2g sugars), 17.1g fat (of which 7.6g saturates), 10.5g fibre and 1.6g salt per portion.",
    "cuisine": "african",
    "courses": [],
    "diets": [],
    "image": "images/lamb_with_hummus_and_07348_16x9.jpg",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/lamb_with_hummus_and_07348",
    "chefName": "",
    "preparationTime": "30 mins to 1 hour",
    "cookingTime": "10 to 30 mins",
    "serves": "Serves 4",
    "ingredientsDesc": [
        "500g/1lb 2oz lamb fillet, cut into 15mm/½in slices",
        "1 lemon, grated rind and juice",
        "1 sprig of rosemary, chopped",
        "3 mixed peppers, cored, deseeded and chopped",
        "1 small aubergine, sliced",
        "4 flour wholemeal tortillas",
        "400g/14oz tin chickpeas, rinsed and drained",
        "2 tbsp Greek yoghurt",
        "2 tbsp lemon juice",
        "1 tbsp chopped parsley",
        "100g/3½oz rocket"
    ],
    "ingredients": [
        "4 flour wholemeal tortillas",
        "aubergine",
        "lemon",
        "rocket",
        "lamb fillet",
        "parsley",
        "lemon juice",
        "chickpeas",
        "peppers",
        "yoghurt",
        "rosemary"
    ],
    "method": [
        "Place the lamb, lemon rind and juice, rosemary and peppers in a non-metallic bowl and stir well. Cover and leave to marinate in a cool place for 30 minutes.",
        "Meanwhile, put the hummus ingredients in a food processor or blender and blitz for 30 seconds. Place in a bowl.",
        "Heat a griddle or heavy-based frying pan, add the lamb mixture and the aubergine and fry for 3—4 minutes, or until the lamb is cooked through (You may need to do this in batches.).",
        "Heat the tortillas. Wrap the lamb and vegetables in the tortillas with the hummus and serve rocket."
    ]
},
{
    "title": "Goat and tomato bredie",
    "description": "Tomato bredie is a South African stew flavoured with ginger, cardamom, cloves and chilli. Here goat steaks provide the meat, but you could use lamb or the traditional mutton.",
    "cuisine": "african",
    "courses": [],
    "diets": [],
    "image": "",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/goat_and_tomato_bredie_87584",
    "chefName": "Brian Turner",
    "preparationTime": "less than 30 mins",
    "cookingTime": "1 to 2 hours",
    "serves": "Serves 2",
    "ingredientsDesc": [
        "12 peppercorns",
        "2 cardamom pods",
        "12 cloves",
        "2 tbsp oil",
        "2 large onions, sliced",
        "100g/3½oz piece cooking chorizo",
        "140ml/4½fl oz chicken stock",
        "2 cinnamon sticks",
        "2.5cm/1in root ginger, grated",
        "1 green chilli, chopped",
        "2 goats' leg steaks",
        "680g/1½ lb new potatoes, halved lengthways",
        "110g/4oz tomatoes, quartered",
        "2 tbsp chopped fresh parsley",
        "sea salt and freshly ground black pepper"
    ],
    "ingredients": [
        "cloves",
        "chilli",
        "oil",
        "ginger",
        "cardamom",
        "chicken stock",
        "parsley",
        "peppercorns",
        "new potatoes",
        "black pepper",
        "cinnamon",
        "chorizo",
        "onions",
        "2 goats' leg steaks",
        "tomatoes"
    ],
    "method": [
        "Tie up the peppercorns, cardamom pods and cloves in a muslin bag.",
        "In a large pan heat one tablespoon of the oil and then fry the onions until golden-brown.",
        "Roughly chop three-quarters of the chorizo and add to the pan.",
        "Add the stock and bring to the boil. Add the cinnamon, ginger, chilli and the muslin spice bag.",
        "Meanwhile, heat the remaining oil in a clean frying pan over a high heat. Colour the leg steaks well on all sides and then add to the stock pan. Cover with a lid and cook for 30 minutes.",
        "In a clean pan of boiling water par-boil the potatoes.",
        "Meanwhile, add the tomatoes to the meat pan and simmer for a further 15 minutes.",
        "Add the potatoes to the meat pan and cook for another 30 minutes, or until the meat and potatoes are cooked.",
        "Meanwhile, slice the remaining chorizo into circles and fry over a medium heat until well-coloured.",
        "Stir the parsley into the stew and season to taste with salt and freshly ground black pepper. Serve topped with the chorizo rings."
    ]
},
{
    "title": "Senegalese couscous with beef and vegetable sauce",
    "description": "Millet and corn couscous are becoming more widely available as a gluten-free alternative to wheat couscous. Fonio is a West African grain that is yet to reach the UK, but quinoa is a good substitution.",
    "cuisine": "african",
    "courses": [],
    "diets": [],
    "image": "",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/senegalese_couscous_with_45637",
    "chefName": "Bineta Diallo",
    "preparationTime": "less than 30 mins",
    "cookingTime": "30 mins to 1 hour",
    "serves": "Serves 6-8",
    "ingredientsDesc": [
        "150g/5½oz millet couscous",
        "150g/5½oz corn couscous",
        "200g/7oz fonio (or quinoa)",
        "1 tbsp butter",
        "2 tbsp vegetable oil",
        "750g/1lb 10oz beef (topside), cut into chunks",
        "100ml/3½fl oz tomato purée",
        "100ml/3½fl oz tomato passata",
        "salt and freshly ground black pepper to taste",
        "250g/9oz onions, chopped",
        "100g/3½oz carrots, chopped",
        "100g/3½oz turnips, chopped",
        "100g/3½oz sweet potatoes, chopped",
        "½ leek, chopped",
        "1 celery stick, chopped",
        "1 garlic clove, crushed"
    ],
    "ingredients": [
        "butter",
        "turnips",
        "oil",
        "topside",
        "carrots",
        "leek",
        "celery",
        "quinoa",
        "passata",
        "black pepper",
        "garlic",
        "couscous",
        "onions",
        "tomato purée",
        "sweet potatoes"
    ],
    "method": [
        "Place the millet couscous, corn couscous and fonio (or quinoa) into three separate bowls and cover with water. Soak for 20 minutes, then drain.  (If you are using quinoa, you will need to par-boil this for ten minutes and drain thoroughly before steaming.)",
        "Place the grains all together in a steamer and steam for 20 minutes, adding water and cooking until the grains are thoroughly cooked through. Add the butter and remove from the heat.",
        "Heat the oil in a pan and gently fry the meat until browned all over (you may need to do this in batches). Add the tomato purée, passata, a little water and salt and pepper to taste to the pan with the beef. After about ten minutes, add the chopped vegetables and the crushed garlic.",
        "Cook for about 15 minutes or until the vegetables are cooked but firm and the sauce has thickened.",
        "Serve the couscous with the meat and vegetable sauce."
    ]
},
{
    "title": "Spicy sausage and spinach rice",
    "description": "",
    "cuisine": "african",
    "courses": [],
    "diets": [],
    "image": "",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/spicysausageandspina_88272",
    "chefName": "Brian Turner",
    "preparationTime": "less than 30 mins",
    "cookingTime": "10 to 30 mins",
    "serves": "Serves 1",
    "ingredientsDesc": [
        "dash olive oil",
        "¼ onion, finely sliced",
        "200g/7oz boerewors (South African) sausage, or other spiced sausage",
        "200g/7oz quick-cook rice",
        "splash boiling water",
        "large handful fresh spinach leaves",
        "½ red chilli, chopped"
    ],
    "ingredients": [
        "olive oil",
        "chilli",
        "sausage",
        "onion",
        "spinach",
        "splash boiling water",
        "rice"
    ],
    "method": [
        "Heat the olive oil in a frying pan, add the onion and fry until softened.",
        "Chop half of the sausage and add to the frying pan. Add the rice and a splash of boiling water and stir until the water is absorbed.",
        "Add the spinach leaves and chilli and stir well until the spinach leaves are beginning to wilt.",
        "In a separate pan, fry the rest of the sausage until golden-brown all over and cooked through.",
        "To serve, spoon the rice onto two serving plates and top with the fried sausage."
    ]
},
{
    "title": "Grilled sausages with onion sauce",
    "description": "",
    "cuisine": "african",
    "courses": [],
    "diets": [],
    "image": "",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/grilledsausageswitho_88273",
    "chefName": "Brian Turner",
    "preparationTime": "less than 30 mins",
    "cookingTime": "10 to 30 mins",
    "serves": "Serves 1",
    "ingredientsDesc": [
        "dash olive oil",
        "½ onion, finely sliced",
        "85g/3oz butter",
        "75ml/2½fl oz white wine",
        "100ml/3½fl oz hot chicken stock",
        "½ fresh red chilli, chopped",
        "3 boerewors (South African) sausages, or other spiced sausages, grilled, to serve"
    ],
    "ingredients": [
        "olive oil",
        "butter",
        "onion",
        "chilli",
        "chicken stock",
        "white wine",
        "sausages"
    ],
    "method": [
        "Heat the olive oil in a frying pan, add the onion and fry until softened but not coloured.",
        "Add the butter, white wine, stock and chilli and simmer for five minutes.",
        "To serve, place the grilled sausages onto a serving plate and pour over the onion sauce."
    ]
},
{
    "title": "Zanzibar chicken",
    "description": "",
    "cuisine": "african",
    "courses": [],
    "diets": [],
    "image": "",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/zanzibarchicken_85461",
    "chefName": "Paul Merrett",
    "preparationTime": "less than 30 mins",
    "cookingTime": "30 mins to 1 hour",
    "serves": "Serves 4",
    "ingredientsDesc": [
        "2 tbsp groundnut oil",
        "1 large chicken, jointed into 8 pieces, skin on",
        "2 onions, finely chopped",
        "3 garlic cloves, crushed",
        "2 green chillies, chopped",
        "3 green or red tomatoes, finely chopped",
        "½ tsp ground turmeric",
        "½ tsp cumin seeds",
        "½ tsp coriander seeds",
        "4 green cardamom pods",
        "2 limes, juice only",
        "275ml/½ pint chicken stock",
        "2 x 400ml/14fl oz cans coconut milk",
        "1 bunch basil",
        "cooked basmati rice, to serve"
    ],
    "ingredients": [
        "basmati rice",
        "coconut milk",
        "2 tbsp groundnut oil",
        "limes",
        "cardamom",
        "coriander seeds",
        "chicken stock",
        "2 green chillies, chopped",
        "cumin",
        "3 green or red tomatoes, finely chopped",
        "garlic",
        "basil",
        "chicken",
        "onions",
        "turmeric"
    ],
    "method": [
        "Heat a deep-sided frying pan until hot and add the oil and then the chicken.",
        "Fry on each side for about one minute, until the meat is browned all over. Remove the meat from the pan and set aside on a plate.",
        "Add the onions, garlic, one of the chillies and the green (or red) tomatoes and cook for about five minutes.",
        "Meanwhile, place the turmeric, cumin seeds, coriander seeds and cardamom pods into a pestle and mortar and grind until fine.",
        "Add the ground spices to the onion and tomato mixture. Add the lime juice.",
        "Add the chicken stock and coconut milk to the pan and bring to the boil.",
        "Return the chicken to the pan and simmer for 20 minutes, until the chicken is cooked through.",
        "Place the remaining chilli and the basil into the pestle and mortar and grind to a paste.",
        "Add the chilli and basil paste to the chicken at the last minute and season to taste.",
        "Serve hot with basmati rice."
    ]
},
{
    "title": "Swahili chicken and papaya salad",
    "description": "",
    "cuisine": "african",
    "courses": [],
    "diets": [],
    "image": "",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/swahilichickenandpap_71266",
    "chefName": "Mike Robinson",
    "preparationTime": "30 mins to 1 hour",
    "cookingTime": "30 mins to 1 hour",
    "serves": "Serves 2",
    "ingredientsDesc": [
        "4 chicken breasts, each cut into three long strips",
        "1 tsp crushed black peppercorns",
        "pinch of cayenne pepper",
        "1 tsp ground cinnamon",
        "1 tsp ground ginger",
        "1 tsp chilli",
        "1 tsp turmeric",
        "1 tsp coriander seeds",
        "1 tsp ground cumin",
        "1 lime, juice only",
        "2 tbsp olive oil",
        "1 lemon grass stalk",
        "2.5cm/1in fresh ginger, chopped",
        "2 large garlic cloves, crushed",
        "2 shallots, finely chopped",
        "2 red chillies, chopped",
        "1 tsp garam masala",
        "1 tsp ground turmeric",
        "400ml/14fl oz coconut milk",
        "1 tin of chopped tomatoes",
        "1 tbsp of coriander leaves",
        "1 papaya, peeled and sliced lengthways",
        "1 red onion, peeled and sliced",
        "1 lime, juice only",
        "olive oil",
        "dash of sweet chilli sauce.",
        "rice to serve"
    ],
    "ingredients": [
        "olive oil",
        "red onion",
        "ginger",
        "garam masala",
        "lime",
        "chicken breasts",
        "chopped tomatoes",
        "lemon",
        "cayenne pepper",
        "rice",
        "coconut milk",
        "papaya",
        "chilli sauce",
        "garlic",
        "peppercorns",
        "shallots",
        "coriander seeds",
        "coriander",
        "chilli",
        "2 red chillies, chopped",
        "cumin",
        "cinnamon",
        "ground ginger",
        "turmeric"
    ],
    "method": [
        "Cut the chicken breasts into long strips, squeeze on some lime juice and leave to marinate for a few minutes.",
        "Then grind together the dry ingredients and rub into the chicken strips.",
        "Griddle on both sides for five minutes until scorched and golden.",
        "To make the Swahili sauce, place the lemon grass, ginger, garlic, shallots, chillies, garam masala and turmeric in a heavy-based saucepan and fry until the shallots soften. Next, add the coconut milk and plum tomatoes, season and leave to simmer for five minutes.",
        "Next toss together the raw papaya and red onion slices and whisk together the lime juice, olive oil and sweet chilli sauce to make a dressing.",
        "Serve the griddled chicken in a mound, with the Swahili sauce drizzled over the top, and your papaya and red onion salad on the side. Garnish with coriander leaves."
    ]
},
{
    "title": "Marinated vegetables",
    "description": "",
    "cuisine": "african",
    "courses": [],
    "diets": [],
    "image": "",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/marinatedvegetables_10899",
    "chefName": "Peter Gottgens",
    "preparationTime": "1-2 hours",
    "cookingTime": "less than 10 mins",
    "serves": "Serves 4",
    "ingredientsDesc": [
        "1 butternut, peeled and sliced",
        "2 large sweet potatoes, peeled and sliced",
        "¼ kabocha pumpkin, peeled and cubed",
        "2 green courgette, cubed",
        "2 yellow courgette, cubed",
        "1 large aubergine, cubed",
        "4 lemons, juice only",
        "50ml/2fl oz balsamic vinegar",
        "1 tsp ginger powder",
        "2 tbsp dark soy sauce",
        "olive oil",
        "50g/ 2oz fresh ginger, chopped",
        "salt and freshly ground black pepper"
    ],
    "ingredients": [
        "olive oil",
        "aubergine",
        "¼ kabocha pumpkin, peeled and cubed",
        "ginger",
        "soy sauce",
        "black pepper",
        "courgette",
        "lemons",
        "balsamic vinegar",
        "2 large sweet potatoes, peeled and sliced",
        "1 butternut, peeled and sliced"
    ],
    "method": [
        "Mix all the marinade ingredients together in a large bowl.",
        "Peel the butternut and sweet potatoes, then slice in pieces no bigger than ½-¾cm/¼-½in thick.",
        "Dice the remaining vegetables to the same size.",
        "Submerge all the vegetables in the marinade for 2 hours.",
        "Take the vegetables out of the marinade and remove any excess liquid.",
        "Place the griddle pan or frying pan on the hob and drizzle with a little olive oil, ensure the pan is hot.",
        "Place the vegetables in the pan and grill for 2-3 minutes."
    ]
},
{
    "title": "Bobotie",
    "description": "",
    "cuisine": "african",
    "courses": [],
    "diets": [],
    "image": "",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/bobotie_83671",
    "chefName": "Antony Worrall Thompson",
    "preparationTime": "less than 30 mins",
    "cookingTime": "1 to 2 hours",
    "serves": "Serves 4",
    "ingredientsDesc": [
        "50ml/2fl oz olive oil",
        "1 onion, chopped",
        "2 garlic cloves, crushed",
        "500g/1lb 2oz lamb mince",
        "1 tbsp hot curry powder",
        "1 lemon, juice and zest only",
        "2 tbsp mango chutney",
        "75g/2½oz sultanas",
        "75g/2½oz toasted almonds",
        "1 slice white bread, soaked in milk for 1 minute then squeezed dry",
        "salt and freshly ground black pepper",
        "4 bay leaves",
        "3 free-range eggs",
        "150ml/5fl oz milk",
        "rice, cooked according to packet instructions",
        "chutneys of your choice",
        "yoghurt"
    ],
    "ingredients": [
        "olive oil",
        "yoghurt",
        "lemon",
        "onion",
        "eggs",
        "mango chutney",
        "lamb mince",
        "milk",
        "4 bay leaves",
        "almonds",
        "garlic",
        "black pepper",
        "curry powder",
        "white bread",
        "rice",
        "sultanas",
        "chutneys"
    ],
    "method": [
        "Preheat the oven to 180C/375F/Gas 4.",
        "Heat half of the oil in a large frying pan over a medium heat. Add the mince and cook until brown. Tip the mince into a sieve and drain off any excess fat.",
        "Wipe the pan clean, add the remaining oil and fry the onions and garlic until softened. Return the mince to the pan.",
        "Add the curry powder, lemon juice and zest, mango chutney, sultanas, toasted almonds and soaked bread and stir well.",
        "Season with salt and freshly ground black pepper, then transfer everything into a greased soufflé dish or loaf tin.",
        "Stick the bay leaves into the mixture.",
        "Break the eggs into a bowl and whisk together with the milk. Pour the egg mixture over the meat mixture.",
        "Cover with tin foil and place into the oven to bake for 40 minutes, or until cooked through and the golden brown.",
        "Serve with rice, chutneys of your choice, yoghurt and any other curry-style accompaniments that take your fancy."
    ]
},
{
    "title": "Crocodile or chicken skewers with cashew nut satay",
    "description": "\"Crocodile is like a really firm white fish crossed with chicken breast. It's an easy eat and very lovely. I wish Tesco would stock it - free handbag with every fillet!\"",
    "cuisine": "african",
    "courses": [],
    "diets": [],
    "image": "",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/crocodileorchickensk_79545",
    "chefName": "The Hairy Bikers",
    "preparationTime": "less than 30 mins",
    "cookingTime": "10 to 30 mins",
    "serves": "Serves 2 as main, 4-6 as nibbles",
    "ingredientsDesc": [
        "1 piece crocodile fillet or 2 large chicken breasts",
        "salt and freshly ground black pepper",
        "Â˝ lemon, juice only",
        "2 tbsp olive oil",
        "1 clove garlic, crushed",
        "1-2 tbsp soy sauce",
        "2 tbsp crunchy peanut butter",
        "110g/4oz unsalted cashew nuts, crushed",
        "1 lime or lemon, juice only",
        "half tin coconut milk",
        "fresh chillies, chopped, to taste",
        "splash soy sauce, to season",
        "palm sugar or light brown muscovado sugar, to taste (optional)",
        "approx 8-12 bamboo skewers or cocktail sticks, for assembling"
    ],
    "ingredients": [
        "chicken breasts",
        "olive oil",
        "coconut milk",
        "approx 8-12 bamboo skewers or cocktail sticks, for assembling",
        "lemon",
        "fresh chillies, chopped, to taste",
        "cashew",
        "soy sauce",
        "palm sugar",
        "black pepper",
        "garlic",
        "peanut butter"
    ],
    "method": [
        "Soak the bamboo skewers or cocktail sticks in cold water for 10 minutes to prevent them from burning.",
        "Season the crocodile or chicken generously with salt and freshly ground black pepper. Cut into strips about 1cm x 2cm (0.5in x 1in).",
        "Mix together the marinade ingredients and marinate the crocodile or chicken strips for half an hour or longer if possible.",
        "To make the satay sauce, combine all the satay sauce ingredients together in a small pan, adding just enough soy sauce to season. Add a little palm sugar or light brown muscovado sugar to sweeten, if necessary.",
        "Simmer very gently for five minutes.",
        "Preheat a barbecue, grill or griddle pan until very hot (the Hairy Bikers cook theirs on an outdoor fire).",
        "Thread two or three strips of marinated crocodile or chicken meat onto each skewer and place on the barbecue or griddle pan or under the grill.",
        "Cook for a few minutes on each side until cooked through and golden, being careful not to overcook.",
        "Serve the skewers with the hot satay sauce for dipping."
    ]
},
{
    "title": "Rock salt and star anise baked crayfish tails with lemon butter",
    "description": "",
    "cuisine": "african",
    "courses": [],
    "diets": [],
    "image": "",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/rocksaltandstaranise_79546",
    "chefName": "The Hairy Bikers",
    "preparationTime": "less than 30 mins",
    "cookingTime": "10 to 30 mins",
    "serves": "Serves 2 as main, 4 as starter",
    "ingredientsDesc": [
        "12 large crayfish, whole",
        "2 kg/4lbs 6oz coarse rock salt",
        "20 whole star anise",
        "2 tbsp coriander seeds",
        "110g/4oz  butter",
        "one lemon, zest and 1 tbsp juice only",
        "sprig lemon thyme (ordinary thyme will do if you can't find lemon thyme)",
        "palm sugar or light brown muscovado sugar, to taste (optional)"
    ],
    "ingredients": [
        "butter",
        "star anise",
        "palm sugar",
        "rock salt",
        "lemon",
        "crayfish",
        "coriander seeds"
    ],
    "method": [
        "Preheat the oven to 180C/355F/Gas 4 (the Hairy Bikers light an outdoor fire to cook theirs).",
        "Part-fill a large cast iron pan with the rock salt, to a depth of at least 5cm (2in). Bury the star anise and coriander seeds randomly throughout the salt.",
        "Transfer to the oven (or onto the fire) and leave until the salt is hot and the star anise is beginning to fume.",
        "Add the crayfish to the pan, on top of the salt, cover and bake for about 15 minutes.",
        "Meanwhile, prepare the lemon butter. Melt the butter in a pan then add the lemon zest and juice and the sprig of lemon thyme. Leave to infuse for a few minutes. If this is too sour, add a little palm sugar or light brown muscovado sugar, to taste.",
        "When the crayfish are cooked, take the pan out of the oven and serve the crayfish still in the pan with the lemon butter on the side.",
        "Eat the tail meat and dip in the sauce."
    ]
},
{
    "title": "Chocolate mealie meal pudding",
    "description": "",
    "cuisine": "african",
    "courses": [],
    "diets": [],
    "image": "",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/chocolatemealiemealp_10895",
    "chefName": "Peter Gottgens",
    "preparationTime": "less than 30 mins",
    "cookingTime": "less than 10 mins",
    "serves": "Serves 8",
    "ingredientsDesc": [
        "5 eggs",
        "5 egg yolks",
        "125g/4oz caster sugar",
        "250g/9oz dark cooking chocolate, chopped",
        "250g/9oz unsalted butter, cut into cubes",
        "40g/1Â˝oz mealie meal or maize meal",
        "20g/Âžoz flour",
        "cocoa powder, for dusting",
        "softened butter, for greasing"
    ],
    "ingredients": [
        "butter",
        "cocoa powder",
        "flour",
        "eggs",
        "chocolate",
        "40g/1Â˝oz mealie meal or maize meal",
        "caster sugar",
        "egg yolks"
    ],
    "method": [
        "Grease dariole moulds liberally with softened butter and dust with cocoa powder. Place in the fridge to chill.",
        "Melt the chocolate and butter over a bain-marie.",
        "Allow to mix thoroughly.",
        "Whisk the eggs, egg yolks and caster sugar together.",
        "When the chocolate and butter have melted, mix slowly in the egg mixture.",
        "Fold the mealie meal or maize meal and the flour in the chocolate mixture gradually.",
        "Fill the moulds 3/4 full with the chocolate mixture and bake at 200C/400F/Gas 6 until just firm on top approx. 7 min.",
        "The center of the pudding should be liquid.  Serve with a  flavoured ice creams see separate recipes)."
    ]
},
{
    "title": "Smoked Texan chicken wings",
    "description": "Great for lunch, a barbecue or picnic, these wings have a hint of chilli but are warmly smoky rather than a flaming firecracker. Chicken wings consisting of just the wing joint without the tip are best for this dish. You’ll need to marinate this dish for at least 2 hours before cooking.",
    "cuisine": "american",
    "courses": [],
    "diets": [],
    "image": "images/smoked_texan_chicken_90596_16x9.jpg",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/smoked_texan_chicken_90596",
    "chefName": "Mary Berry",
    "preparationTime": "over 2 hours",
    "cookingTime": "30 mins to 1 hour",
    "serves": "Serves 6",
    "ingredientsDesc": [
        "1kg/2lb 4oz chicken wings (tips removed)",
        "1 tbsp light muscovado sugar",
        "1 tbsp tomato ketchup",
        "2 tsp sweet smoked paprika",
        "1 garlic clove, crushed",
        "1 fresh red chilli, deseeded and finely chopped",
        "2 tbsp Worcestershire sauce",
        "2 tbsp olive oil",
        "salt and freshly ground black pepper"
    ],
    "ingredients": [
        "olive oil",
        "chilli",
        "chicken wings",
        "Worcestershire sauce",
        "paprika",
        "black pepper",
        "garlic",
        "sugar",
        "ketchup"
    ],
    "method": [
        "Put the chicken in a large bowl and season with salt and pepper. Put the remaining ingredients in another bowl and mix.",
        "Pour the marinade over the chicken and toss to coat. Cover with cling film and marinate in the fridge for at least 2 hours or overnight.",
        "When you are ready to cook the chicken, preheat the oven to 220C/200C Fan/Gas 7 or heat up the barbecue. If you are using a barbecue, allow the flames to flare up and die down until the coals are just glowing before you start to cook the chicken.",
        "If cooking in the oven, transfer the chicken and marinade to a roasting tin in a single layer. Roast or barbecue for about 30 minutes, turning once halfway through, or until cooked through and a deep golden-brown.",
        "Serve hot or cold with salad and coleslaw."
    ]
},
{
    "title": "Deep South pulled pork sliders with sweet potato fries and coleslaw ",
    "description": "Perfect for a crowd and easy to make, these sliders will give your party a USA vibe!",
    "cuisine": "american",
    "courses": [],
    "diets": [],
    "image": "",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/deep_south_pulled_pork_60591",
    "chefName": "Donal Skehan",
    "preparationTime": "overnight",
    "cookingTime": "1 to 2 hours",
    "serves": "Serves 4",
    "ingredientsDesc": [
        "1 x 1kg/2lb 4oz boneless pork shoulder",
        "4 floury baps, to serve",
        "1 large onion, finely chopped",
        "8 garlic cloves, roughly chopped",
        "1½ tsp Tabasco",
        "½ tsp coriander seeds",
        "2 tbsp English mustard powder",
        "2 tsp paprika",
        "6 tbsp tomato ketchup",
        "1 tbsp Worcestershire sauce",
        "2 tbsp treacle",
        "75g/2¾oz dark brown sugar",
        "sea salt",
        "3 sweet potatoes, cut into thin chips",
        "1 tbsp vegetable oil",
        "2 tsp Cajun seasoning",
        "a few fresh thyme sprigs",
        "3 tbsp buttermilk",
        "3 tbsp mayonnaise",
        "1 tbsp apple cider vinegar",
        "1 garlic clove, finely chopped",
        "3 carrots, grated",
        "½ head white cabbage, finely shredded",
        "½ head red cabbage, finely shredded",
        "6 spring onions, thinly sliced",
        "salt and freshly ground black pepper"
    ],
    "ingredients": [
        "vegetable oil",
        "red cabbage",
        "seasoning",
        "carrots",
        "Worcestershire sauce",
        "sweet potatoes",
        "brown sugar",
        "2 tbsp treacle",
        "pork shoulder",
        "buttermilk",
        "mayonnaise",
        "Tabasco",
        "flour",
        "black pepper",
        "garlic",
        "coriander seeds",
        "ketchup",
        "vinegar",
        "onion",
        "thyme",
        "white cabbage",
        "paprika",
        "spring onions",
        "sea salt",
        "English mustard"
    ],
    "method": [
        "To make the marinade, put all the ingredients in a blender and blend until you have a smooth mixture.",
        "For the sliders, put the pork in a large saucepan, pour over the marinade and turn the meat until coated. Cover and marinade in the fridge for 2 hours, or overnight if you have the time.",
        "Place the pan over a high heat, add just enough water to cover the meat (you will need about 1 litre/1¾ pints) and bring to the boil. Reduce the heat to a steady simmer, cover with a lid and cook for 1½ hours, or until the meat pulls apart easily with a fork. You will need to turn the pork during the cooking time.",
        "Meanwhile, preheat the oven to 210C/190C Fan/Gas 6. Put the sweet potato in a large roasting tin, drizzle over the oil and sprinkle with the Cajun seasoning and thyme. Roast for 35–40 minutes, turning halfway, until slightly charred on the edges.",
        "When the pork is cooked, remove it from the sauce using a carving fork. Shred the meat, then transfer to a plate, cover with kitchen foil and set aside. Return the marinade to the heat and bring a steady simmer. Cook without a lid until reduced and thick.",
        "For the coleslaw, put the buttermilk, mayonnaise, vinegar and garlic in a large bowl. Add the carrots, cabbages and spring onions and toss until coated. Season with salt and pepper.",
        "To serve, spoon the sauce over the pork. Toast the buns. Serve the pork in a toasted buns with the sweet potato fries and coleslaw."
    ]
},
{
    "title": "American-style pancakes with blueberries",
    "description": "An American classic, these fluffy blueberry pancakes make the perfect brunch.",
    "cuisine": "american",
    "courses": [],
    "diets": [],
    "image": "",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/american_style_pancakes_94634",
    "chefName": "The Hairy Bikers",
    "preparationTime": "less than 30 mins",
    "cookingTime": "10 to 30 mins",
    "serves": "Makes 8 x 20cm/8in pancakes",
    "ingredientsDesc": [
        "450g/1lb self-raising flour",
        "1 tsp baking powder",
        "½ tsp ground cinnamon (optional)",
        "small pinch salt",
        "50g/1¾oz butter, melted, plus a small knob for frying",
        "600ml/20fl oz buttermilk",
        "3 large free-range eggs, separated",
        "1 tsp vanilla extract, or seeds scraped from 1 vanilla pod",
        "300g/10½oz blueberries, plus extra to serve",
        "150g/5½oz butter, softened",
        "pinch of ground cinnamon",
        "4 tbsp maple syrup"
    ],
    "ingredients": [
        "butter",
        "maple syrup",
        "blueberries",
        "vanilla extract",
        "flour",
        "eggs",
        "baking powder",
        "buttermilk",
        "cinnamon",
        "salt"
    ],
    "method": [
        "For the pancakes, put the flour, baking powder, cinnamon, if using, and salt in a large bowl, mix and make a well in the centre. Put the buttermilk, egg yolks, melted butter and vanilla in a large bowl and whisk. In a separate, clean glass bowl, whisk the egg whites until stiff peaks form.",
        "Pour the buttermilk mixture into the well in the flour mixture and whisk. Add a large spoonful of the egg whites and fold in with a metal spoon to loosen the batter a little. Stir in the rest of the egg whites, preserving as much of the air as possible, until you have a fluffy, bubbly batter.",
        "Heat a 20cm/8in frying pan to a medium heat and rub over a little butter. Pour one and a half ladlefuls of batter into the pan. Sprinkle a large handful of blueberries over the pancake; it will rise up around them as it cooks. When the pancake has browned on the bottom and is firm enough to flip (cooked through beyond halfway), turn it over quickly and cook for another minute on the other side. Transfer to a plate. Repeat with the rest of the batter and blueberries.",
        "For the maple butter, put the butter, cinnamon and a pinch of salt into a bowl. Whisk with a hand whisk until white and fluffy. Gradually whisk in the maple syrup until it is all incorporated and has a whipped consistency."
    ]
},
{
    "title": "Chocolate chip fluffy pancakes",
    "description": "Utterly scrumptious, these are a kid's dream pancake loaded with chocolate chips and served with ice cream.",
    "cuisine": "american",
    "courses": [],
    "diets": [],
    "image": "images/chocchippuffypancake_65968_16x9.jpg",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/chocchippuffypancake_65968",
    "chefName": "Silvana Franco",
    "preparationTime": "less than 30 mins",
    "cookingTime": "less than 10 mins",
    "serves": "Serves 2",
    "ingredientsDesc": [
        "2 free-range eggs",
        "5 tbsp milk",
        "150g/5oz self-raising flour",
        "2 tbsp caster sugar",
        "pinch of salt",
        "75g/3oz dark chocolate chips",
        "sunflower oil, for frying",
        "butterscotch ice cream, to serve",
        "maple syrup or clear honey, to serve"
    ],
    "ingredients": [
        "maple syrup",
        "salt",
        "eggs",
        "sunflower oil",
        "self-raising flour",
        "caster sugar",
        "dark chocolate",
        "milk",
        "ice cream"
    ],
    "method": [
        "Whisk together the eggs and milk.",
        "Place the plain flour, caster sugar and a pinch of salt in large bowl, then make a well in the centre, pour in the liquid and beat with a hand whisk until smooth.",
        "Stir in the chocolate chips, then cook spoonfuls of the mixture in a non-stick pan, using just a tiny splash of sunflower oil, for 1-2 minutes on each side until puffed and golden.",
        "Stack and serve with a scoop of butterscotch ice cream and a drizzle of maple syrup."
    ]
},
{
    "title": "Buttermilk pancakes with maple bacon",
    "description": "Thick, fluffy pancakes served the American way with glazed bacon and maple syrup.",
    "cuisine": "american",
    "courses": [],
    "diets": [],
    "image": "images/buttermilk_pancakes_10390_16x9.jpg",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/buttermilk_pancakes_10390",
    "chefName": "John Torode",
    "preparationTime": "less than 30 mins",
    "cookingTime": "10 to 30 mins",
    "serves": "Serves 6",
    "ingredientsDesc": [
        "350g/12oz self-raising flour",
        "1 tsp bicarbonate of soda",
        "½ tsp salt",
        "2 tbsp caster sugar",
        "200ml/7fl oz buttermilk",
        "400ml/14fl oz semi-skimmed milk",
        "2 free-range eggs",
        "85g/3oz unsalted butter, melted, plus extra for frying",
        "12 rashers smoked streaky bacon",
        "50ml/1¾oz maple syrup"
    ],
    "ingredients": [
        "butter",
        "maple syrup",
        "bicarbonate of soda",
        "self-raising flour",
        "bacon",
        "eggs",
        "buttermilk",
        "caster sugar",
        "salt",
        "milk"
    ],
    "method": [
        "In a bowl, sift together the flour, bicarbonate of soda, salt and sugar.",
        "In a separate bowl or jug, mix together the buttermilk, milk, eggs and butter.  Pour the wet mixture into the dry and stir to combine. Do not overbeat – stir just to combine.",
        "Melt a small knob of butter in a large frying pan.  Using a ladle, pour some batter into the pan to make a pancake. Depending on the size of your pan, you may be able to make more than one pancake at a time, or if you are confident you can use two pans at the same time.",
        "Cook the pancakes for about a minute, or until the underside is golden-brown and the top is bubbling. Then turn them over using a palette knife or fish slice and cook for another minute. Keep the pancakes warm in a very low oven while you cook the remaining batter.",
        "Meanwhile, preheat the grill to medium/hot.  Lay the bacon on a grill tray lined with foil and brush with maple syrup.  Grill until one side of the bacon is crisp. Turn over and brush the other side with maple syrup and cook until crisp.",
        "Serve the pancakes stacked on top of each other, topped with grilled bacon and drizzled with maple syrup."
    ]
},
{
    "title": "Macaroni cauliflower cheese ",
    "description": "Mac and cheese is a winner with most families - this one contains hidden vegetables as an added healthy bonus.Equipment and preparation: For this recipe you will need a hand-held blender or food processor to make the sauce.",
    "cuisine": "american",
    "courses": [],
    "diets": [],
    "image": "images/macaroni_cauliflower_53315_16x9.jpg",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/macaroni_cauliflower_53315",
    "chefName": "Justine Pattison",
    "preparationTime": "less than 30 mins",
    "cookingTime": "30 mins to 1 hour",
    "serves": "Makes 4",
    "ingredientsDesc": [
        "1 small cauliflower (approximately 775g/1¾lb), leaves and stalk removed, cut into florets",
        "250g/9oz dried macaroni or similar small pasta shapes",
        "50g/2oz butter, plus extra for greasing",
        "50g/2oz plain flour",
        "500ml/17fl oz milk",
        "150g/5oz mature cheddar, finely grated",
        "salt (optional) and freshly ground black pepper"
    ],
    "ingredients": [
        "butter",
        "plain flour",
        "cauliflower",
        "cheddar",
        "black pepper",
        "macaroni",
        "milk"
    ],
    "method": [
        "Preheat the oven to 200C/180C Fan/Gas 6. Lightly grease a 2 litre/3½ pint shallow ovenproof dish with butter.",
        "Half fill a large saucepan with water and bring to the boil. Add the cauliflower florets and boil for 10-12 minutes, or until very soft. Drain and set aside.",
        "Half-fill the same pan with water and return to the boil. Add the macaroni and cook for 8-10 minutes, or until al dente.",
        "Meanwhile, melt the butter in a saucepan over a low heat, then whisk in the flour until the mixture forms a smooth paste. Cook, whisking constantly, for 30 seconds.",
        "Gradually whisk in the milk a little at a time, bringing the mixture to a gentle simmer and waiting for it to thicken after each addition. Continue to cook, stirring constantly, until all of the milk has been incorporated and the sauce has thickened enough to coat the back of a spoon (about 6-8 minutes).",
        "Stir in two-thirds of the cheese, then season with salt and pepper.",
        "Add the cauliflower to the sauce, blend until smooth using a hand-held blender. Warm the mixture through gently, adding a little more seasoning or milk, as required. The finished sauce should have the consistency of pouring custard.",
        "Drain the pasta and transfer to the ovenproof dish. Pour over the sauce and stir to combine. Sprinkle over the remaining cheese. Bake for 20-25 minutes, or until the top is golden-brown and the sauce is bubbling."
    ]
},
{
    "title": "Low-fat Caesar salad",
    "description": "This easy Caesar salad recipe uses all the ingredients you’d expect to find, but varies the method to make it lighter.",
    "cuisine": "american",
    "courses": [],
    "diets": [],
    "image": "",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/low-fat_caesar_salad_38342",
    "chefName": "Sophie Wright",
    "preparationTime": "less than 30 mins",
    "cookingTime": "10 to 30 mins",
    "serves": "Serves 4",
    "ingredientsDesc": [
        "2-3 slices sourdough bread, depending on size",
        "1 tsp olive oil",
        "1 garlic clove, peeled",
        "2 heads Cos lettuce, leaves separated and torn",
        "1 tbsp finely grated parmesan cheese",
        "1 free-range egg yolk",
        "4 anchovies in olive oil, drained, oil reserved",
        "½ garlic clove, grated",
        "½ lemon, juice and zest",
        "1 tsp Dijon mustard",
        "25g/1oz Parmesan, finely grated",
        "2 tbsp extra-virgin olive oil",
        "black pepper"
    ],
    "ingredients": [
        "olive oil",
        "lemon",
        "Dijon mustard",
        "anchovies",
        "Cos lettuce",
        "egg yolk",
        "Parmesan",
        "sourdough bread",
        "black pepper",
        "garlic",
        "parmesan"
    ],
    "method": [
        "Heat a griddle pan over a high heat until smoking. Drizzle the bread with a little oil and then rub with the garlic clove.",
        "Griddle the bread for 30-40 seconds on each side, or until golden-brown and crisp with deep char-grill lines. Leave to cool slightly and then tear into bite-sized pieces.",
        "Meanwhile make the dressing. Put the egg yolk, anchovies, a tablespoon of the reserved anchovy oil, the garlic, lemon zest and juice, mustard and parmesan into a small food processor along with a pinch or two of pepper. Blend to a paste. (Alternatively, chop everything really fine, and mash into a paste in a mixing bowl until as smooth as possible.)",
        "With the motor running gradually trickle in the oil, a few drops at a time, until completely incorporated. If the dressing is too thick, add a little warm water (about two tablespoons) and blend again. Season to taste with black pepper.",
        "Put the lettuce into a serving bowl. Pour over some of the dressing and toss to mix and coat. Scatter over the croûtons and the grated parmesan and serve."
    ]
},
{
    "title": "Caesar salad",
    "description": "",
    "cuisine": "american",
    "courses": [],
    "diets": [],
    "image": "images/caesarsalad_72154_16x9.jpg",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/caesarsalad_72154",
    "chefName": "Antony Worrall Thompson",
    "preparationTime": "less than 30 mins",
    "cookingTime": "less than 10 mins",
    "serves": "Serves 2-3",
    "ingredientsDesc": [
        "1 large free-range egg",
        "1 large garlic clove, peeled and crushed",
        "1 tbsp lime juice",
        "2 tsp Worcestershire sauce",
        "4-5 anchovy fillets, chopped",
        "3 tbsp olive oil, plus a little extra for frying",
        "freshly ground black pepper",
        "2 thick slices of white bread, crusts removed, cubed",
        "1 cos lettuce, washed, dried, and torn into pieces",
        "25g/1oz parmesan cheese, coarsely grated"
    ],
    "ingredients": [
        "4-5 anchovy fillets, chopped",
        "olive oil",
        "lime juice",
        "cos lettuce",
        "Worcestershire sauce",
        "black pepper",
        "garlic",
        "parmesan",
        "white bread",
        "egg"
    ],
    "method": [
        "Place the egg in a pan of cold water and bring to the boil. Boil for one minute and then plunge into cold water to stop the cooking process.",
        "Once the egg is cool enough to handle, crack the egg into a food processor and add the garlic, lime juice, Worcestershire sauce, anchovies and oil. Process well and add pepper to taste.",
        "Heat a little olive oil in a frying pan, then fry the bread cubes until crisp and golden-brown, then drain on kitchen paper.",
        "Place the cos lettuce into a large bowl.",
        "To serve, pour the dressing over the leaves and add the fried bread cubes and parmesan. Toss well and serve at once."
    ]
},
{
    "title": "Smoky mutton Sloppy Joe with crispy lamb’s breast",
    "description": "Impress your friends with these tasty lamb Sloppy Joe’s, perfect for a party. If you don't have time to make the crispy lamb's breast garnish you can substitute with crisps.",
    "cuisine": "american",
    "courses": [],
    "diets": [],
    "image": "",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/smokey_mutton_sloppy_joe_19958",
    "chefName": "Daniel Doherty",
    "preparationTime": "overnight",
    "cookingTime": "over 2 hours",
    "serves": "Serves 4-6",
    "ingredientsDesc": [
        "50g/1¾oz sea salt",
        "25g/1oz caster sugar",
        "2 sprigs thyme, leaves only",
        "10 black peppercorns, crushed",
        "1 star anise, crushed",
        "100g/3½oz piece of lamb’s breast",
        "200g/7oz duck fat",
        "vegetable oil, for frying",
        "plain flour, for dusting",
        "sea salt and freshly ground pepper",
        "500g/1lb 2oz minced mutton",
        "2 onions, finely diced",
        "2 garlic cloves, finely chopped",
        "4 chipotle chillies in adobo, mashed to a rough paste",
        "2 tsp harissa",
        "2 sprigs rosemary",
        "4 bay leaves",
        "3 tbsp tomato purée",
        "200g/7oz tomato ketchup",
        "4 tbsp Worcestershire sauce",
        "4 tbsp soy sauce",
        "6 brioche hot dog buns, split",
        "fresh coriander leaves, for garnish"
    ],
    "ingredients": [
        "vegetable oil",
        "star anise",
        "fresh coriander",
        "Worcestershire sauce",
        "duck fat",
        "onions",
        "tomato purée",
        "lamb",
        "harissa",
        "mutton",
        "bay leaves",
        "sugar",
        "chipotle",
        "brioche",
        "black pepper",
        "garlic",
        "ketchup",
        "plain flour",
        "thyme",
        "soy sauce",
        "sea salt",
        "rosemary"
    ],
    "method": [
        "To make the cure place all the ingredients onto a baking tray and mix them together. Place the lamb breast on the baking tray and rub with the cure, cover with cling film and leave in the fridge for 24 hours.",
        "Pre-heat oven to 130C/260F/Gas Mark ½. Remove the lamb from the fridge and brush off all of the cure. Put it in an ovenproof dish, add the duck fat to cover, and cook in the oven for 3 hours, or until the meat is tender and gives easily when pushed with a spoon. Allow to cool in the fat. When cool enough to handle, pull the meat into strands with your fingers, then store, covered, in the fridge.",
        "For the Sloppy Joe mix, put the mutton in a large frying pan over a medium heat and cook for a few minutes, pouring away any fat as it melts. Add the onions and garlic and cook for 10 minutes, or until the onions are soft. Turn the heat to low, add the remaining ingredients and cook for one hour.",
        "Heat the oil in a deep-fat fryer or in a deep heavy-based saucepan to 180C/350F. (CAUTION: Hot oil can be dangerous; do not leave unattended). Dust a handful of the lamb with flour and fry for 2-3 minutes, or until crisp. Place on kitchen paper to dry, and season with salt and pepper. Remove the pan from the heat.",
        "Toast the brioche buns and fill with the Sloppy Joe mix. Top with the crispy lamb and coriander and serve."
    ]
},
{
    "title": "Chicken meatloaf",
    "description": "The Hairy Bikers' made this meatloaf for Meat Loaf on Saturday Kitchen.",
    "cuisine": "american",
    "courses": [],
    "diets": [],
    "image": "",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/chicken_meatloaf_53803",
    "chefName": "The Hairy Bikers",
    "preparationTime": "less than 30 mins",
    "cookingTime": "1 to 2 hours",
    "serves": "Serves 8",
    "ingredientsDesc": [
        "1 tbsp olive oil",
        "1 small onion, finely chopped",
        "2 garlic cloves, crushed or grated",
        "750g/1lb 19oz minced chicken",
        "50g/1¾oz bacon, finely chopped",
        "1 tsp ground oregano",
        "1 tsp lemon zest",
        "1 tsp Dijon mustard",
        "1 tsp Worcestershire sauce",
        "50ml/2fl oz double cream",
        "100g/3½oz breadcrumbs",
        "2 free-range egg whites",
        "100g/3½oz gruyère, grated",
        "5 slices of rindless streaky bacon",
        "100ml/3½fl oz ketchup",
        "1 tsp Worcestershire sauce",
        "1 tbsp Dijon mustard",
        "1 tbsp maple syrup",
        "1 tbsp cider vinegar"
    ],
    "ingredients": [
        "olive oil",
        "maple syrup",
        "lemon",
        "Dijon mustard",
        "onion",
        "vinegar",
        "Worcestershire sauce",
        "bacon",
        "egg whites",
        "gruyère",
        "garlic",
        "double cream",
        "oregano",
        "breadcrumbs",
        "chicken",
        "ketchup"
    ],
    "method": [
        "Preheat the oven to 180C/160C Fan/Gas 4.",
        "Heat the olive oil in a frying pan. Add the onion and sauté for a few minutes until soft and starting to take on some colour. Add the garlic and cook for a further minute. Remove from the heat and leave to cool.",
        "Put the chicken in a large bowl and season with salt and pepper. Add the chopped bacon, oregano, zest, mustard, cream and breadcrumbs, followed by the cooled onion and garlic. Add the egg and stir everything together thoroughly.",
        "Take a small piece of the mixture and fry it. Taste and adjust the seasoning and any other flavours accordingly.",
        "For the glaze, put all the ingredients into a saucepan and season with salt and pepper. Heat through gently and set aside.",
        "Take half the chicken mixture, and mould it onto a baking tray, using the size of a loaf pan for guidance and making it as even as you can. Put the cheese down the centre, making sure you leave a border all the way round, then top with the remaining chicken mixture, building up round the sides and making sure it is well sealed as you don’t want the cheese leaking out. You should end up with a slightly domed loaf. Brush on some of the glaze.",
        "Cut the bacon slices in half and stretch with the back of a knife. Each slice should reach from the base of one side, over the top and to the bottom of the other side. Brush with a little more of the glaze.",
        "Bake for 30 minutes, then remove and brush with the remaining glaze. Bake for a further 30 minutes, by which time the meatloaf should be cooked through with nicely crisp bacon. Serve in thick slices."
    ]
},
{
    "title": "The Biker burger",
    "description": "This is the perfect burger. The beauty is in its simplicity – just chuck steak and a little seasoning.",
    "cuisine": "american",
    "courses": [],
    "diets": [],
    "image": "",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/classic_burgers_58632",
    "chefName": "The Hairy Bikers",
    "preparationTime": "less than 30 mins",
    "cookingTime": "less than 10 mins",
    "serves": "Serves 4",
    "ingredientsDesc": [
        "800g/1lb 12oz chuck steak, trimmed of any gristle or hard pieces of fat, chilled",
        "50g/1¾oz bone marrow, finely diced (optional)",
        "4 burger buns, split",
        "flaked sea salt and freshly ground black pepper",
        "100g/3½oz mayonnaise",
        "2 tbsp tomato ketchup",
        "squeeze of lemon juice",
        "1 large gherkin, finely chopped",
        "1 tsp garlic powder",
        "½ tsp chipotle paste or other hot sauce"
    ],
    "ingredients": [
        "ketchup",
        "lemon juice",
        "black pepper",
        "garlic",
        "gherkin",
        "4 burger buns, split",
        "marrow",
        "steak",
        "mayonnaise",
        "chipotle"
    ],
    "method": [
        "Make sure the meat is well chilled – if you freeze it, then let it thaw partially, you’ll find it much easier to cut. Put it through a coarse mincer, or chop it very finely by hand. It should be fine enough to stick together when you squeeze a handful. Add the bone marrow, if using.",
        "Season the steak with salt and a little black pepper, then divide the mixture into four and shape each one into a round pattie 2–2.5cm/¾–1in thick. The mincing and chopping will help bring the meat to room temperature, but if it’s still cold, leave the burgers to stand for a while.",
        "For the burger sauce, mix together all the ingredients in a bowl.",
        "Heat a frying pan or your barbecue. When too hot to hold your hand over, add the burgers – there’s no need for oil, as some fat will render out of the meat. Cook for 4 minutes, or until the burgers are well seared and have a thick crust. Flip them and cook for another 3 minutes for rare meat, 4 minutes for medium-rare, 5 for medium and up to 6 for well done. Serve with the burger sauce."
    ]
},
{
    "title": "French dip sandwich",
    "description": "Mustardy beef and mushroom gravy are piled into a baguette in this decadent sandwich. You could also add onions, sliced very finely, to the roasting tin, tucked underneath the meat.",
    "cuisine": "american",
    "courses": [],
    "diets": [],
    "image": "",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/french_dip_sandwich_25385",
    "chefName": "The Hairy Bikers",
    "preparationTime": "30 mins to 1 hour",
    "cookingTime": "1 to 2 hours",
    "serves": "Serves 6-8",
    "ingredientsDesc": [
        "2 tsp sea salt",
        "1 tsp black peppercorns, ground",
        "1 tsp dried mustard powder",
        "1 tsp dried thyme",
        "2kg/4lb 8oz piece of sirloin, rolled",
        "2 tbsp dripping or oil",
        "15g/½oz butter",
        "2 shallots, finely chopped",
        "250g/9oz button mushrooms, finely sliced",
        "1 garlic clove, sliced",
        "1 large sprig thyme, leaves only",
        "1 tbsp plain flour",
        "200ml/7fl oz red or white wine",
        "500ml/18fl oz beef stock (or consommé)",
        "2 tbsp finely chopped fresh tarragon",
        "couple of large baguettes",
        "butter (or dripping)",
        "mustard or horseradish (optional)"
    ],
    "ingredients": [
        "butter",
        "white wine",
        "oil",
        "beef stock",
        "thyme",
        "sirloin",
        "black pepper",
        "mushrooms",
        "horseradish",
        "mustard powder",
        "garlic",
        "shallots",
        "sea salt",
        "plain flour",
        "baguettes",
        "tarragon"
    ],
    "method": [
        "Preheat the oven to 220C/200C Fan/Gas 7. Mix the sea salt, pepper, mustard powder and thyme together and press it into the surface areas of the sirloin.",
        "Put the dripping or oil in a roasting tin and heat over a fairly high heat until simmering. Sear the beef on all sides until fairly deep brown, then transfer to the oven. Cook to your liking (10 minutes per 500g/1lb 2oz for rare, 15 minutes per 500g/1lb 2oz for medium-rare, 20 minutes per 500g/1lb 2oz for medium and 25 minutes per 500g/1lb 2oz for well-done).",
        "Once the roast has finished cooking, remove from the tin and leave on a platter, covered with foil, to rest for at least 20 minutes. Strain off any fat and juices from the roasting tin and set aside.",
        "For the gravy, heat the butter in a saucepan. Add the shallots and button mushrooms and cook until the shallots are a light golden-brown. Add the garlic and thyme and stir for another 2 minutes.",
        "Sprinkle in the flour, and stir for a couple of minutes. Add the wine and allow it to bubble and for the volume of liquid to reduce by half. Add the stock (or consommé) and cook until reduced by a third. Stir in the tarragon.",
        "Taste and season with salt and pepper. Add any juices from the roast beef, and if you want to extract the most amount of the flavour from the roasting tin, add the sauce to the roasting tin and stir vigorously over a low heat to incorporate the caramelised cooking juices (this is called deglazing). Transfer to a warm jug.",
        "Serve the sirloin sliced with the gravy, piled into buttered baguette. Good with mustard or horseradish on the side."
    ]
},
{
    "title": "Cheese and chutney strata",
    "description": "Layers of egg, goats’ cheese, bread and chutney come together in this classy American brunch recipe. Allow the strata to sit for 10 minutes before baking.",
    "cuisine": "american",
    "courses": [],
    "diets": [],
    "image": "",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/cheese_and_chutney_77502",
    "chefName": "Matt Tebbutt",
    "preparationTime": "less than 30 mins",
    "cookingTime": "30 mins to 1 hour",
    "serves": "Serves 6",
    "ingredientsDesc": [
        "2 tbsp olive oil",
        "20g/¾oz baby spinach leaves",
        "1 garlic clove, chopped",
        "300g/10½oz chutney",
        "1 day-old French-style baguette, cut into 1cm/½ in rounds",
        "4 free-range eggs",
        "450ml/16fl oz full-fat milk",
        "150g/5½oz strong cheddar cheese, grated",
        "350g/12oz soft goats’ cheese, torn into pieces",
        "2 sprigs rosemary",
        "salt and freshly ground black pepper"
    ],
    "ingredients": [
        "olive oil",
        "baguette",
        "spinach",
        "rosemary",
        "eggs",
        "cheddar",
        "milk",
        "black pepper",
        "garlic",
        "cheese",
        "chutney"
    ],
    "method": [
        "Preheat the oven to 160C/140C Fan/Gas 3.",
        "Heat a frying pan and add the oil. Tip in the spinach and garlic and cook until wilted. Season with salt and pepper.",
        "Lay the spinach in an ovenrpoof serving dish. Spread the chutney over one side of the cut baguette and place on top of the spinach.",
        "Whisk the eggs with the milk in a bowl. Stir in the cheddar, and season with salt and pepper. Pour this mixture over the spinach and bread and leave to sit for 10 minutes.",
        "Dot the goats’ cheese and the rosemary sprigs over the top and bake in the oven for 30 minutes, or until the cheese has melted. Serve straight away."
    ]
},
{
    "title": "Pecan pie",
    "description": "Try our recipe for a classic pecan pie. Serve with whipped double cream or vanilla ice cream.",
    "cuisine": "american",
    "courses": [],
    "diets": [],
    "image": "images/pecanpie_86028_16x9.jpg",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/pecanpie_86028",
    "chefName": "Brenda Blethyn",
    "preparationTime": "less than 30 mins",
    "cookingTime": "1 to 2 hours",
    "serves": "Serves 6",
    "ingredientsDesc": [
        "110g/4oz unsalted butter",
        "110g/4oz golden syrup",
        "1 tsp vanilla extract",
        "225g/8oz brown sugar",
        "3 free-range eggs, beaten",
        "1 x 245g/8Â˝oz shop-bought shortcrust pastry case",
        "285g/10oz pecan nuts, halved"
    ],
    "ingredients": [
        "butter",
        "vanilla extract",
        "eggs",
        "shortcrust pastry",
        "golden syrup",
        "pecan",
        "brown sugar"
    ],
    "method": [
        "Preheat the oven to 180C/350F/Gas 4.",
        "Place the butter, golden syrup, vanilla extract and sugar into a heavy-based saucepan over a low heat.",
        "When the butter has melted, remove the pan from the heat and leave to cool for 5-10 minutes.",
        "Add the beaten eggs to the mixture and stir well.",
        "Set aside a small handful of the pecan nuts. Arrange the remaining pecan halves evenly in the pastry case and carefully pour over the syrup mixture.",
        "Place into the preheated oven and bake for 40-50 minutes - the pie will be golden-brown, but the filling should still be slightly soft.",
        "Leave the pie to cool on a wire tray. As the pie begins to set, decorate the top with the reserved pecan halves. Serve in slices."
    ]
},
{
    "title": "Pumpkin pie",
    "description": "Antony Worrall Thompson shows how to make your own pumpkin pie in eight simple steps - no need to be spooked!",
    "cuisine": "american",
    "courses": [],
    "diets": [],
    "image": "images/pumpkinpie_70659_16x9.jpg",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/pumpkinpie_70659",
    "chefName": "Antony Worrall Thompson",
    "preparationTime": "less than 30 mins",
    "cookingTime": "30 mins to 1 hour",
    "serves": "Serves 8",
    "ingredientsDesc": [
        "sweet short crust pastry case (or a packet of ready made sweet short crust pastry with 40g/1½oz crushed pecans mixed in)",
        "450g/1lb prepared weight pumpkin flesh, cut into 1in/2.5 cm chunks",
        "2 large eggs plus 1 yolk (use the white for another dish)",
        "75g/3oz soft dark brown sugar",
        "1 tsp ground cinnamon",
        "½ level teaspoon freshly grated nutmeg",
        "½ tsp ground allspice",
        "½ tsp ground cloves",
        "½ tsp ground ginger",
        "275ml/10fl oz double cream"
    ],
    "ingredients": [
        "cloves",
        "2 large eggs plus 1 yolk (use the white for another dish)",
        "allspice",
        "nutmeg",
        "cinnamon",
        "pastry",
        "double cream",
        "pumpkin",
        "ground ginger",
        "brown sugar"
    ],
    "method": [
        "Pre-heat the oven to 200C/400F/Gas 6.",
        "If using a shop bought sweet crust pastry case, use one that is 23cm/9in diameter and 4cm/1½in deep. If using your own pastry, roll it out and use it to line a 23cm/9in pie plate (not loose bottomed). Bake the pastry case blind for 20 minutes.",
        "To make the filling, place the pumpkin chunks on a baking tray, cover with foil and roast until tender. This will take about 20-30 minutes, depending on your pumpkin. Press the cooked pumpkin in a coarse sieve and to extract any excess water. Set aside to cool before blending in a food processor, or mashing by hand to a pureé.",
        "Lightly whisk the eggs and extra yolk together in a large bowl.",
        "Place the sugar, spices and the cream in a pan, bring to simmering point, giving it a whisk to mix everything together. Then pour it over the eggs and whisk it again briefly.  Now add the pumpkin pureé, still whisking to combine everything thoroughly.",
        "Reduce the oven temperature to 180C/350F/Gas 4. Pour the filling into your pastry case and bake for 35-40 minutes, by which time it will puff up round the edges but still feel slightly wobbly in the centre.",
        "Remove the pie from the oven and place the tin on a wire cooling rack. Serve warm or chilled (stored loosely covered in foil in the fridge) with some chilled créme fraïche or whipped cream."
    ]
},
{
    "title": "Pot-roast turkey drumstick",
    "description": "Turkey is not just for Christmas! The drumsticks cost very little and stretch a long way - perfect for a meaty pot-roast on a modest budget.This pot-roast can be cooked in advance and frozen, check the tips section for freezing instructions.",
    "cuisine": "american",
    "courses": [],
    "diets": [],
    "image": "images/pot-roast_turkey_75303_16x9.jpg",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/pot-roast_turkey_75303",
    "chefName": "Justine Pattison",
    "preparationTime": "less than 30 mins",
    "cookingTime": "over 2 hours",
    "serves": "Serves 3-4",
    "ingredientsDesc": [
        "1 x 825g/1lb 13oz turkey drumstick",
        "2 tbsp sunflower oil",
        "4 carrots, trimmed",
        "4 celery sticks, trimmed",
        "1 onion, roughly chopped",
        "1 tsp mixed dried herbs",
        "1 bay leaf",
        "1 chicken stock cube",
        "500ml/18fl oz just-boiled water",
        "150ml/5fl oz red wine (or chicken stock)",
        "2 tbsp tomato purée",
        "2 tbsp redcurrant jelly or cranberry sauce",
        "300g/10½oz small new potatoes, scrubbed and halved",
        "1 tbsp cornflour",
        "salt and freshly ground black pepper"
    ],
    "ingredients": [
        "turkey",
        "500ml/18fl oz just-boiled water",
        "bay leaf",
        "onion",
        "chicken stock",
        "carrots",
        "black pepper",
        "new potatoes",
        "celery",
        "herbs",
        "sunflower oil",
        "cornflour",
        "redcurrant jelly",
        "tomato purée"
    ],
    "method": [
        "Preheat the oven to 170C/150C Fan/Gas 3. Season the turkey drumstick all over with salt and pepper.",
        "Heat the oil in a flameproof, lidded casserole over a medium heat. Add the turkey drumstick and fry for 4-5 minutes, turning regularly until lightly browned on all sides. Transfer to a plate and set aside.",
        "Chop the carrots and celery into roughly 2.5cm/1in lengths. Add the onion, celery and carrot to the casserole and fry for 4-5 minutes, stirring regularly. Stir in the herbs and bay leaf and continue to cook for a further 30-40 seconds.",
        "Dissolve the chicken stock cube in the just-boiled water, then pour it into the casserole along with the wine (or extra chicken stock). Stir in the tomato purée and the redcurrant jelly (or cranberry sauce) and return the turkey drumstick to the mixture.",
        "Cover the casserole with the lid and transfer to the oven. Cook for 1½ hours. After 1½ hours, add the new potatoes to the casserole, turn the turkey drumstick over, then replace the lid and continue to cook for a further 1½ hours, or until the turkey is very tender and the meat is falling off the bone.",
        "Remove the turkey drumstick from the casserole and transfer it to a chopping board. Set aside until cool enough to handle. Meanwhile, spoon as much fat as possible from the surface of the casserole.",
        "In a small bowl, whisk the cornflour with a tablespoon of cold water to form a thick paste. Stir this paste into the pot-roast sauce. Heat the sauce until it is simmering and continue to stir until thickened.",
        "While the sauce is thickening, remove the skin from the turkey drumstick, then remove the meat from the bone in large chunks, discarding any bone or sinew.",
        "To serve, spoon the pot-roast sauce into bowls and place equal amounts of the turkey meat on top of each portion. Serve with freshly steamed green cabbage."
    ]
},
{
    "title": "Ring doughnuts ",
    "description": "There’s little else as tempting as a fresh batch of homemade doughnuts, especially topped with a zingy thick lemon icing.Equipment and preparation: you will need a 8cm/3¼in straight sided round cutter and a 2cm/¾in cutter.",
    "cuisine": "american",
    "courses": [],
    "diets": [],
    "image": "",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/ring_doughnuts_95428",
    "chefName": "Paul Hollywood",
    "preparationTime": "1-2 hours",
    "cookingTime": "10 to 30 mins",
    "serves": "Makes 8",
    "ingredientsDesc": [
        "250g/9oz strong white flour, plus extra for flouring",
        "25g/1oz caster sugar",
        "20g/¾oz unsalted butter, softened",
        "1 free-range egg",
        "7g instant yeast",
        "5g salt",
        "75ml/2½fl oz warm milk",
        "sunflower oil, for deep fat frying",
        "200g/7oz icing sugar",
        "1 lemon, zest only",
        "1 lemon, zest only"
    ],
    "ingredients": [
        "butter",
        "icing sugar",
        "lemon",
        "yeast",
        "salt",
        "sunflower oil",
        "strong white flour",
        "caster sugar",
        "egg",
        "milk"
    ],
    "method": [
        "For the doughnuts, place all the ingredients into a large bowl (except the sunflower oil) with three tablespoons of water.",
        "Stir with your hands to make a dough.",
        "Gradually add another another tablespoon of water and massage in the bowl for four minutes.",
        "Tip the dough onto a lightly floured surface and knead well for 10 minutes, or until the dough is smooth and elastic.",
        "Place into a bowl and leave to rise for 40 minutes, covered with a damp tea towel.",
        "Tip the dough out, again onto a very lightly floured surface.",
        "Divide the dough in half.",
        "With a floured rolling pin, roll out the dough quite thinly to about 1cm/½in thick. Cut into rounds using an 8cm/3¼in straight sided round cutter, then use a 2cm/¾in cutter to cut holes out of the middle.",
        "Spin each doughnut on your index finger to expand the hole.",
        "You should be able to cut out about eight doughnuts from this dough.  Place all circles onto an oiled baking tray, loosely cover with cling film, not allowing it to touch the top of the doughnuts and leave to rise for 30 minutes.",
        "Preheat a deep fat fryer, filled with sunflower oil to 180C/350F (Caution: hot oil can be dangerous; do not leave unattended.)",
        "Drop each doughnut in separately, cooking each side for about a minute or until golden-brown. Remove with a slotted spoon and place onto a plate lined with kitchen towel to soak up the excess oil.",
        "Leave to cool.",
        "For the icing, gradually add 25ml/1fl oz of cold water to the icing sugar. It will eventually turn into a thick paste. Stir in the lemon zest.",
        "When the whole doughnuts have cooled, brush the tops of the doughnuts with the icing. Sprinkle over a little more lemon zest.",
        "Leave to set on a cooling rack, to cool completely."
    ]
},
{
    "title": "Perfect apple pie",
    "description": "Perfect your pastry to the Bikers’ standard with this delicious recipe for apple pie. Equipment and preparation: You’ll need a 1.2 litre/2 pint pie dish.",
    "cuisine": "american",
    "courses": [],
    "diets": [],
    "image": "images/perfect_apple_pie_73735_16x9.jpg",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/perfect_apple_pie_73735",
    "chefName": "The Hairy Bikers",
    "preparationTime": "less than 30 mins",
    "cookingTime": "30 mins to 1 hour",
    "serves": "Serves 6",
    "ingredientsDesc": [
        "5oz golden caster sugar, plus 1 tbsp for sprinkling",
        "1 tsp ground cinnamon",
        "2 tbsp cornflour",
        "600g/1lb 5oz Bramley cooking apples, peeled, cored, sliced",
        "400g/14oz plain flour, plus extra rolling",
        "2 tbsp caster sugar",
        "1 lemon, zest only",
        "250g/10oz cold butter, cut into cubes",
        "1 free-range egg, beaten with 2 tbsp cold water, plus 1 free-range egg, beaten, to glaze"
    ],
    "ingredients": [
        "butter",
        "plain flour",
        "lemon",
        "cornflour",
        "cinnamon",
        "caster sugar",
        "egg",
        "apples"
    ],
    "method": [
        "For the pastry, place the flour, sugar and lemon zest into a bowl and rub in the butter until the mixture resembles breadcrumbs. Add the beaten egg and stir with a round-bladed knife until the mixture forms a dough.",
        "Set aside one-third of the pastry for the lid.",
        "Roll out the remaining pastry on a lightly floured surface until the thickness of a pound coin and 5-7cm/2-3in larger than the pie dish. Lift the pastry over the rolling pin and lower it gently into the pie dish.",
        "Press the pastry firmly into the dish and up the sides, making sure there are no air bubbles. Chill the fridge for a few minutes.",
        "Preheat the oven to 200C/180 (fan)/Gas 6. Place a baking tray into the oven to preheat.",
        "For the filling, mix the sugar, cinnamon and cornflour in a large bowl. Stir in the apples.",
        "Place the apple filling into the pie dish, making sure that it rises above the edge. Brush the rim of the dish with beaten egg.",
        "Roll out the reserved ball of pastry. Cover the pie with the pastry and press the edges together firmly to seal. Using a sharp knife, trim off the excess pastry, then gently crimp all around the edge. Make a few small holes in the centre of the pie with the tip of a knife. Glaze the top with beaten egg.",
        "Lightly knead the pastry trimmings and re-roll. Cut into leaf shapes place all around the edge of the pie, slightly overlapping each other, and glaze with more egg. Sprinkle the pie with sugar and bake in the centre of the oven for 45–55 minutes or golden-brown all over and the apples are tender."
    ]
},
{
    "title": "Halloween ghost cupcakes",
    "description": "Halloween food doesn't have to be gory. These cute ghost cupcakes are great for younger kids' Halloween parties.",
    "cuisine": "american",
    "courses": [],
    "diets": [],
    "image": "images/halloween_ghost_cupcakes_04170_16x9.jpg",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/halloween_ghost_cupcakes_04170",
    "chefName": "Jayne Cross",
    "preparationTime": "30 mins to 1 hour",
    "cookingTime": "30 mins to 1 hour",
    "serves": "Makes 18 cupcakes",
    "ingredientsDesc": [
        "140g/5oz butter, softened",
        "250g/9oz caster sugar",
        "2 free-range eggs, lightly beaten",
        "1 tsp vanilla extract",
        "150g/5½oz plain flour",
        "75g/2½oz self-raising flour",
        "1 tsp bicarbonate of soda",
        "50g/2oz cocoa powder",
        "200ml/7fl oz buttermilk or plain yoghurt",
        "250g/9oz sugar",
        "120g/4½oz golden syrup",
        "4 free-range eggs, whites only",
        "2 tbsp chocolate sugar strands"
    ],
    "ingredients": [
        "butter",
        "plain flour",
        "cocoa powder",
        "vanilla extract",
        "eggs",
        "sugar",
        "buttermilk",
        "golden syrup",
        "caster sugar",
        "chocolate",
        "self-raising flour",
        "bicarbonate of soda"
    ],
    "method": [
        "Preheat the oven to 180C/350F/Gas 4. Line twelve muffin tins with muffin cases.",
        "For the cakes, beat together the butter and sugar with a hand-held mixer until very light and fluffy. Add the eggs a little at a time beating well after each addition. Add the vanilla extract with the last of the egg.",
        "Sift together the flours, bicarbonate of soda and cocoa into a large mixing bowl.",
        "Gently fold the flour mix into the butter mixture along with the buttermilk until completely combined and smooth.",
        "Place a dessertspoonful of the batter into each muffin case then bake in the oven for 20 minutes until firm to the touch.",
        "Place on a wire rack to cool.",
        "For the icing, place the sugar, golden syrup and four tablespoons of water into a large saucepan. Heat gently, stirring until the sugar has dissolved.",
        "Bring the sugar syrup to the boil and cook for about 5-6 minutes until the syrup reaches 115C/239F when measured with a sugar thermometer. Remove the pan from the heat.",
        "While the syrup is boiling, in a large bowl whisk the egg whites with a hand-held mixer until soft peaks form when the whisk is removed. Then, with the mixer on a low speed, pour in the sugar syrup in a thin steady stream - be careful not to pour the syrup onto the beaters as it may splash onto your hands.",
        "Once all the syrup has been added increase the speed of the mixer and mix for about 10 minutes until the icing is completely cool, thick and glossy. Do not skimp on the whipping or your icing will be too soft and your ghosts will sag.",
        "Place the icing into a piping bag fitted with a large plain nozzle. Pipe a circle of icing onto each cupcake. Then, holding the bag upright over the centre of the cake, pipe a tall mound of icing, then quickly pull the tip away to form a small peak on the top.",
        "Add chocolate sugar strands for eyes or any decoration you fancy. The meringue icing will keep out of the fridge (the sugar syrup will have pasteurised the egg white), but make sure they don’t get too hot or the meringue will melt."
    ]
},
{
    "title": "Roast chicken with waffles",
    "description": "Try roasting a chicken the Thomas Keller way with his all-American recipe. You'll need a waffle-maker for this recipe.",
    "cuisine": "american",
    "courses": [],
    "diets": [],
    "image": "",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/roast_chicken_with_54406",
    "chefName": "Thomas Keller",
    "preparationTime": "over 2 hours",
    "cookingTime": "30 mins to 1 hour",
    "serves": "Serves 4",
    "ingredientsDesc": [
        "5 litres/1 gallon water",
        "175g/6oz sea salt flakes",
        "100g/4oz honey",
        "12 bay leaves",
        "6 garlic cloves, skin left on, smashed",
        "2 tbsp black peppercorns",
        "10g/¼oz fresh rosemary leaves",
        "10g/¼oz thyme leaves",
        "50g/2oz flat-leaf parsley",
        "2 lemons, zest and juice",
        "2 x 1.175kg/2½lbs chickens",
        "Sea salt flakes and freshly ground black pepper",
        "2 tbsp canola oil",
        "2 tsp chopped thyme leaves",
        "fleur de sel",
        "2 tbsp canola oil",
        "3 shallots, cut into medium dice",
        "1 carrot, cut into medium dice",
        "3 garlic cloves",
        "25g/1oz button mushrooms, cut into medium diced",
        "1 fresh tomato, cut into medium dice",
        "40ml/1½fl oz white wine",
        "1sprig fresh parsley",
        "1 sprig fresh thyme",
        "1 bay leaf",
        "10 black peppercorns",
        "125ml/4½fl oz dark chicken stock",
        "260g/9½oz plain flour",
        "1 tbsp baking powder",
        "1 tsp sea salt flakes",
        "1 tbsp granulated sugar",
        "3 free-range eggs, lightly beaten",
        "425ml/15fl oz full-fat milk",
        "110g/4oz unsalted butter, melted"
    ],
    "ingredients": [
        "bay leaf",
        "lemons",
        "mushrooms",
        "carrot",
        "fleur de sel",
        "baking powder",
        "chicken stock",
        "parsley",
        "sugar",
        "white wine",
        "cloves",
        "butter",
        "oil",
        "eggs",
        "fat",
        "5 litres/1 gallon water",
        "black pepper",
        "garlic",
        "shallots",
        "12 bay leaves",
        "tomato",
        "honey",
        "plain flour",
        "thyme",
        "salt",
        "chickens",
        "rosemary"
    ],
    "method": [
        "Place all of the brine ingredients into a large saucepan. Cover with a lid and boil for one minute, stirring to dissolve the salt. Remove from the heat and set aside to cool.",
        "Rinse the chickens thoroughly under cold running water. Add the chicken to the brine. (Ensure it’s submerged in the brine – you can do this with a plate, if necessary.) Chill in the fridge for six hours.",
        "Preheat the oven to 240C/475°F/Gas 9.",
        "Remove the chickens from the brine, rinse under cold running water and pat dry with kitchen paper.",
        "Season the inside of each chicken with a light sprinkling of salt and freshly ground black pepper.",
        "To truss the chickens, place one chicken on a tray with the legs towards you. Tuck the wing tips under the bird. Cut a 90cm/3ft piece of kitchen twine and place it on top of the neck end of the breast.",
        "Lift the neck end of the bird and pull the twine down around the wings and under the chicken, then bring the ends up over the breast, towards you, and tie the twine into a knot, pulling it tight to plump the breast.",
        "Bring the ends of the twine around the ends of the drumsticks and straight up. Tie as before to pull the drumsticks together and form a compact bird; tie again to secure the knot. Repeat the process with the second chicken. Let the chickens sit at room temperature for 20 to 30 minutes before roasting.",
        "Season the outside of the chickens with a light sprinkling of salt and freshly ground black pepper.",
        "Place two heavy-based, ovenproof frying pans over a high heat. When they are hot, add half the oil to each and heat until hot.",
        "Put the chickens breast-side up into the pans, and then into the oven with the legs facing the back of the oven. Roast for 40 minutes, checking the birds every 15 minutes and rotating the griddle pans if the chickens are browning unevenly.",
        "After 40 minutes, check the temperature of the birds by inserting a thermometer between the leg and the thigh. The temperature should read approximately 68C/155F. (The chicken will continue to cook as it sits, reaching a temperature of about 73C/165°F.)",
        "When the birds are cooked, remove from the oven, add the thyme leaves to the pans, and baste the birds with the juices and thyme leaves. Set aside in a warm place for ten minutes.",
        "To carve the chicken, cut the twine between the legs and pull on one end; the entire piece will pull away easily. Cut each bird into four pieces.",
        "Remove each leg by cutting through the joint where the thigh joins the body. Slice off each side of the breast, leaving the wings attached to the breast meat; cut off and discard the wing tips.",
        "For the chasseur jus, place the canola oil into a saucepan over a medium heat. Add the shallots, carrots, garlic cloves and button mushrooms. Fry until lightly coloured.",
        "Add the tomato and stir until well combined. Pour in the wine and reduce the sauce until the liquid has almost evaporated.",
        "Add the herbs and chicken stock. Bring to a simmer and skin the scum regularly for 30 minutes. Strain the sauce through a fine sieve and into a clean saucepan.",
        "For the waffles, preheat a waffle maker to a medium setting and preheat the oven to 140C/275F/Gas 1. Place a large wire rack onto a baking sheet and keep it warm.",
        "Mix the flour, baking powder, salt and granulated sugar in a large mixing bowl. Whisk in the eggs, milk and butter until well combined.",
        "Ladle some of the batter into each well of the waffle maker and close the lid and cook for five minutes, or until golden-brown and crispy. Repeat the process until the batter is used up.",
        "To serve, arrange one piece of breast and a leg on each serving plate and top with the sauce. Sprinkle with fleur de sel and place two waffles alongside. Serve with vanilla butter and maple syrup."
    ]
},
{
    "title": "Maryland fried chicken with waffles and maple syrup",
    "description": "Does it get any better than fried chicken? This is a classic American recipe, taken up a notch here with waffles and maple syrup.For this recipe you will need a waffle maker.",
    "cuisine": "american",
    "courses": [],
    "diets": [],
    "image": "",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/maryland_fried_chicken_30424",
    "chefName": "The Hairy Bikers",
    "preparationTime": "over 2 hours",
    "cookingTime": "30 mins to 1 hour",
    "serves": "Serves 4",
    "ingredientsDesc": [
        "1.7kg/3lb 11oz oven-ready chicken, jointed into 8 pieces",
        "250ml/9fl oz buttermilk",
        "1 tbsp Worcestershire sauce",
        "200g/7oz plain flour",
        "2 tsp flaked sea salt",
        "1 tbsp paprika",
        "½ tsp cayenne pepper, or to taste",
        "1 tsp freshly ground black pepper, or to taste",
        "1 tsp dried thyme",
        "1 tsp dried oregano",
        "500ml/18fl oz sunflower or groundnut oil, for frying",
        "50g/1¾oz butter",
        "sunflower oil, for greasing",
        "150g/5½oz plain flour",
        "3 tbsp cornflour",
        "1½ tsp baking powder",
        "1 tbsp golden caster or white granulated sugar",
        "1 large free-range egg",
        "225ml/8fl oz semi-skimmed milk",
        "maple syrup, to serve",
        "butter, to serve (optional)"
    ],
    "ingredients": [
        "butter",
        "maple syrup",
        "plain flour",
        "thyme",
        "cayenne pepper",
        "nut",
        "cornflour",
        "Worcestershire sauce",
        "paprika",
        "baking powder",
        "buttermilk",
        "sunflower oil",
        "black pepper",
        "oregano",
        "chicken",
        "sea salt",
        "egg",
        "milk",
        "sugar"
    ],
    "method": [
        "For the fried chicken, put the chicken in a bowl or shallow dish and pour over the buttermilk and Worcestershire sauce. Toss the chicken in the buttermilk mixture, cover with cling film and allow to marinate in the fridge for at least 2 hours and up to 4 hours before cooking.",
        "When you are ready to cook, put the plain flour in a large, shallow dish. Add the salt, paprika, cayenne pepper, black pepper, thyme and oregano. Mix all the dry ingredients thoroughly. Preheat the oven to 180C/160C Fan/Gas 4.",
        "Pour the oil into a large saucepan or deep frying pan and set over a medium high heat. Place a thermometer in the oil and heat to 180C (CAUTION: hot oil can be dangerous. Do not leave unattended.) Alternatively, heat the oil in a deep fat fryer.",
        "Take each a piece of chicken with tongs and shake lightly to remove any excess buttermilk. Drop it into the flour. Turn until well coated, then remove with tongs and put on a plate. Repeat with the rest of the chicken. When the oil has reached the right temperature, very carefully lower the chicken pieces into the oil. Cook in batches of 3 or 4 pieces at a  time, cook for 2-3 minutes on each side, or until brown and crisp. Allowing the oil to return to the right temperature between batches will help ensure your chicken is light and crisp.",
        "Take the cooked chicken out of the pan with clean tongs (not the tongs that have been used for raw chicken). Put on a baking tray lined with kitchen roll to help soak up any excess oil. Scoop out any stray pieces of batter from the oil with a slotted spoon.",
        "Transfer the fried chicken to a rack and put on a baking tray. Bake in the oven for 15 minutes, or until cooked through.",
        "For the waffles, put the butter in a small saucepan and melt over a low heat. Preheat a waffle maker to its second highest setting, greasing with a little oil according to the manufacturer’s instructions.",
        "Mix the flour, cornflour, baking powder, sugar and a good pinch of fine salt in a bowl and make a well in the centre. Whisk the egg with the milk and melted butter in a jug with a metal whisk until smooth. Gradually whisk the milk and egg mixture into the flour until just combined. Pour into the jug and leave to stand for 10 minutes.",
        "Pour just enough of the batter into the waffle maker to fill each plate and quickly smooth the surface with a palatte knife or spatula. Close the lid and cook the waffles for 4-5 minutes, or until well risen, crisp and brown. Lift carefully out of the waffle maker with tongs and keep warm while the remaining waffles are cooked.",
        "Once cooked, drain the chicken well on more kitchen roll and serve hot with the waffles, maple syrup and a knob of butter, if you like."
    ]
},
{
    "title": "Buffalo wings",
    "description": "Sticky, spicy buffalo wings - perfect for any party or as a treat for a family dinner!",
    "cuisine": "american",
    "courses": [],
    "diets": [],
    "image": "",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/buffalo_wings_09457",
    "chefName": "The Hairy Bikers",
    "preparationTime": "overnight",
    "cookingTime": "30 mins to 1 hour",
    "serves": "Serves 4",
    "ingredientsDesc": [
        "1kg/2lb 4oz chicken wings, tips removed and split into “drumettes” and “flats”",
        "vegetable oil, for deep frying",
        "a few celery sticks",
        "salt and freshly ground black pepper",
        "50g/1¾oz butter",
        "2 garlic cloves, crushed",
        "125ml/4fl oz hot sauce",
        "1 tbsp cider vinegar",
        "1 tsp caster sugar",
        "100g/3½oz creamy blue cheese",
        "1 small onion, very finely chopped",
        "100ml/3½fl oz buttermilk",
        "150ml/5fl oz crème fraîche",
        "1 tsp cider vinegar"
    ],
    "ingredients": [
        "butter",
        "cloves",
        "oil",
        "chicken wings",
        "onion",
        "125ml/4fl oz hot sauce",
        "vinegar",
        "sugar",
        "celery",
        "buttermilk",
        "150ml/5fl oz crème fraîche",
        "black pepper",
        "cheese"
    ],
    "method": [
        "If you have time, prepare the wings by sprinkling generously with salt. Lay out, on a rack in the fridge, cover and chill overnight – this will help them crisp when you fry them. An hour before you want to cook them, remove from the fridge to bring to room temperature and pat dry.",
        "For the hot sauce, melt the butter in a small saucepan and add the garlic. Cook gently for a minute or two, then whisk in the hot sauce, vinegar and sugar. Season with salt and pepper.",
        "To make the blue cheese sauce, mash the cheese with the onion, buttermilk, crème fraîche and vinegar.",
        "Pour enough oil in a deep-fat fryer or large saucepan, to fill it no more than halfway. Heat the oil to 160C. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Cook the wings in batches for around 10 minutes, then drain them of any excess oil. Raise the temperature of the oil to 190C and fry again, cooking for a further 2 minutes, until cooked through, very crisp and deep brown. Turn out on to kitchen paper.",
        "Put the wings in a bowl and smother them in the hot sauce. Serve them with the blue cheese sauce and celery sticks."
    ]
},
{
    "title": "American style pancakes with sausage",
    "description": "Fluffy American pancakes just like you get in a diner, serve with maple syrup and bacon for a special brunch.",
    "cuisine": "american",
    "courses": [],
    "diets": [],
    "image": "",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/american_style_pancakes_03212",
    "chefName": "The Hairy Bikers",
    "preparationTime": "less than 30 mins",
    "cookingTime": "10 to 30 mins",
    "serves": "Makes 8 x 20cm/8in pancakes",
    "ingredientsDesc": [
        "500g/1lb 2oz sausagemeat",
        "450g/1lb self-raising flour",
        "1 tsp baking powder",
        "pinch of salt",
        "600ml/20fl oz buttermilk",
        "3 large free-range eggs, separated",
        "50g/1¾oz butter, melted, plus extra for frying",
        "maple syrup, to serve"
    ],
    "ingredients": [
        "butter",
        "maple syrup",
        "sausage",
        "eggs",
        "baking powder",
        "buttermilk",
        "salt",
        "self-raising flour"
    ],
    "method": [
        "Put the sausagemeat in a large frying pan and break it up using a wooden spatula or spoon. Fry the meat, stirring regularly and continuing to break it up, until well browned and cooked through. If a lot of fat has rendered out, turn out onto a piece of kitchen paper, otherwise leave in the frying pan, off the heat, until you need it.",
        "Put the flour in a large bowl with the baking powder and add a pinch of salt. Mix to combine and remove any lumps then make a well in the middle and set aside. Combine the egg yolks, melted butter and buttermilk. In a separate bowl, whisk the egg whites until stiff peaks form when the whisk is removed.",
        "Pour the buttermilk mixture into the flour and whisk until well combined. Add a large spoonful of the egg whites and fold in using a large metal spoon. Stir in the rest of the egg whites, trying to preserve as much of the air in the whites as possible. You should have a fluffy, bubbly batter.",
        "Heat a frying pan (preferably around 20cm/8in) to a medium heat and rub over a little butter. Pour 1½ ladlefuls of the batter into the frying pan – it should spread out to around 20cm/8in in diameter. Take a couple of tablespoons of the sausage mixture and sprinkle over the pancake. The pancake will rise up around the sausage meat as it cooks. When the pancake has browned on the bottom and is firm enough to flip, turn it over quickly and cook for another minute on the other side. Repeat with the rest of the batter and the sausage meat. Serve with maple syrup."
    ]
},
{
    "title": "Sweetcorn fritters",
    "description": "These savoury fritters are the perfect accompiniment to fried chicken or pulled pork.",
    "cuisine": "american",
    "courses": [],
    "diets": [],
    "image": "",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/sweetcorn_fritters_46558",
    "chefName": "The Hairy Bikers",
    "preparationTime": "less than 30 mins",
    "cookingTime": "10 to 30 mins",
    "serves": "Makes 10 fritters",
    "ingredientsDesc": [
        "300g/10½oz sweetcorn",
        "3 spring onions, very finely chopped",
        "3 free-range eggs",
        "30ml/1fl oz milk",
        "75g/2½oz plain flour",
        "½ tsp cayenne pepper",
        "vegetable oil, for frying",
        "salt and freshly ground black pepper"
    ],
    "ingredients": [
        "vegetable oil",
        "plain flour",
        "eggs",
        "black pepper",
        "cayenne pepper",
        "spring onions",
        "sweetcorn",
        "milk"
    ],
    "method": [
        "To make the fritters, put the sweetcorn and spring onions into a bowl. Beat the eggs with the milk. Pour this mixture over the sweetcorn and mix well. Season with salt and pepper. Sieve the flour with the cayenne pepper and then stir into the sweetcorn.",
        "Add the oil to a large frying pan – you need to shallow fry these, so make sure the base of the pan is well covered. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Heat the oil then test by adding a tiny bit of the batter – it should immediately start bubbling around the edges when it hits the oil. Using a small ladle, drop batter onto the oil – you need around 2 tbsp of mixture per fritter. You should be able to fry 4-5 at any one time. Fry for a couple of minutes on one side until a light brown then turn over and cook for a further minute.",
        "Turn out onto kitchen towel to blot off any excess oil and keep warm. Continue until you have used up all the batter."
    ]
},
{
    "title": "New England clam chowder",
    "description": "",
    "cuisine": "american",
    "courses": [],
    "diets": [],
    "image": "",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/newenglandclamchowde_89058",
    "chefName": "Sanjeev Bhaskar",
    "preparationTime": "less than 30 mins",
    "cookingTime": "10 to 30 mins",
    "serves": "Serves 2",
    "ingredientsDesc": [
        "1 tbsp olive oil",
        "3 bacon rashers, finely chopped",
        "2 onions, peeled and chopped",
        "1 clove garlic, chopped",
        "2 tbsp plain flour",
        "1 can clams in water",
        "3 large potatoes, chopped into cubes",
        "2 tbsp celery leaves, chopped",
        "salt and freshly ground black pepper",
        "1 bay leaf",
        "1 tbsp butter"
    ],
    "ingredients": [
        "olive oil",
        "butter",
        "3 large potatoes, chopped into cubes",
        "plain flour",
        "bay leaf",
        "bacon",
        "black pepper",
        "celery",
        "clams",
        "garlic",
        "onions"
    ],
    "method": [
        "Heat the olive oil in a frying pan, add the bacon and fry for 3-4 minutes, or until crisp. Remove from the pan and set aside. Add the chopped onions and garlic to the pan and gently fry for 3-4 minutes, or until softened but not coloured.",
        "Return the bacon to pan, stir in the flour slowly and mix until smooth to form a roux.",
        "Drain the clams, reserving the liquid. Place the liquid in a measuring cup and add enough water to bring the measure up to 480ml/17fl oz. Gradually add the liquid to the pan with the bacon, stirring until it thickens.",
        "Add the potatoes, chopped celery leaves, salt and freshly ground black pepper and bay leaf, bring to the boil and simmer until the potatoes are tender. If the chowder is too thick, thin down with some milk.",
        "Add the clams and the butter and heat, stirring continuously, for 2-3 minutes but do not allow the mixture to boil. Pour into a bowl and serve."
    ]
},
{
    "title": "American-style pancakes with blueberries",
    "description": "",
    "cuisine": "american",
    "courses": [],
    "diets": [],
    "image": "",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/americanstylepancake_89165",
    "chefName": "Denis Lawson",
    "preparationTime": "less than 30 mins",
    "cookingTime": "less than 10 mins",
    "serves": "Serves 4-5",
    "ingredientsDesc": [
        "115g/4oz self-raising flour",
        "Â˝ tsp baking powder",
        "2 large eggs, separated",
        "125ml/5fl oz milk",
        "pinch salt",
        "400g/14oz fresh blueberries",
        "vegetable oil, for brushing"
    ],
    "ingredients": [
        "vegetable oil",
        "self-raising flour",
        "milk",
        "baking powder",
        "400g/14oz fresh blueberries",
        "salt",
        "eggs"
    ],
    "method": [
        "Sieve the flour and baking powder into a bowl and make a well in the middle.",
        "Place the yolks and the milk into the well in the flour mixture, and whisk to create a smooth batter. The batter should be the consistency of double cream. Add a little extra milk if necessary, although you may not need it all.",
        "Whisk the egg whites in a clean bowl with a pinch of salt, until stiff peaks form when the whisk is removed.",
        "Fold the egg whites into the batter.",
        "Heat a heavy non-stick pan over a medium heat and brush it with some vegetable oil.",
        "Pour two tablespoons of the batter into the pan, smoothing it out into a circle. Cook for one minute, or until bubbles start to form on the surface, then add a handful of blueberries, and cook for another minute. Turn the pancake and cook the other side for one minute, or until golden-brown. Remove from the pan and reserve in a warm place.",
        "Repeat with the remaining batter and berries and serve immediately."
    ]
},
{
    "title": "Doughnuts",
    "description": "There's nothing quite like freshly cooked doughnuts - and you'll never be short of friends when you go to the trouble.",
    "cuisine": "american",
    "courses": [],
    "diets": [],
    "image": "images/doughnuts_89027_16x9.jpg",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/doughnuts_89027",
    "chefName": "Tamsin Greig",
    "preparationTime": "1-2 hours",
    "cookingTime": "less than 10 mins",
    "serves": "Makes 12",
    "ingredientsDesc": [
        "1 tbsp yeast",
        "4 tbsp caster sugar",
        "150ml/5¼fl oz milk, warmed",
        "225g/8oz plain flour, plus extra for dusting",
        "¼ tsp salt",
        "50g/2oz butter, melted",
        "1 free-range egg, beaten",
        "300ml/10½fl oz vegetable oil, for deep-frying",
        "jam of your choice"
    ],
    "ingredients": [
        "butter",
        "vegetable oil",
        "plain flour",
        "yeast",
        "egg",
        "jam",
        "caster sugar",
        "salt",
        "milk"
    ],
    "method": [
        "Mix the yeast with half a teaspoon of the sugar and two tablespoons of the warm milk. Place in a warm place to rest for 15 minutes, or until frothy.",
        "Sift the flour and salt into a large bowl. Stir in one tablespoon of the sugar.",
        "Make a well in the flour and pour in the yeast mix, the rest of the milk, the melted butter and the egg. Mix to make a dough and then knead, cover the bowl and leave to stand for 45 minutes, or until the dough has doubled in size.",
        "On a floured work surface, knead the dough for five minutes, then divide into 12 balls and place in a warm place for 30 minutes, or until they have doubled in size.",
        "Heat the oil in a deep pan until it reaches 190C/375F, or a cube of bread dropped in sizzles and turns golden in 30 seconds. (CAUTION: hot oil can be dangerous. Do not leave  unattended.)",
        "Gently lower the dough balls one at a time into the hot oil, in batches of two or three, and fry for 3-5 minutes or until golden-brown, and then carefully turn over. Remove from the hot oil with a slotted spoon and drain on kitchen paper.",
        "Roll the hot doughnuts in the remaining sugar. Make a small slit in the doughnut with the tip of a knife, and fill with a teaspoon of jam. Serve."
    ]
},
{
    "title": "Corned beef hash with beer-battered onion rings",
    "description": "James Martin serves up a plate of souped-up Seventies-style comfort food. Perfect for a cosy night in.",
    "cuisine": "american",
    "courses": [],
    "diets": [],
    "image": "",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/corned_beef_hash_with_09807",
    "chefName": "James Martin",
    "preparationTime": "less than 30 mins",
    "cookingTime": "10 to 30 mins",
    "serves": "Serves 4",
    "ingredientsDesc": [
        "4 floury potatoes, such as Maris Piper, peeled and diced",
        "vegetable oil, for deep-frying",
        "100g/3½oz plain flour",
        "1 tbsp caster sugar",
        "pinch salt",
        "2 tbsp cider vinegar",
        "150-200ml/5-7fl oz beer or lager",
        "2 onions, 1 cut into 1cm/½in-thick slices, 1 chopped",
        "50g/1¾oz butter",
        "1 garlic clove, crushed",
        "4 ripe tomatoes, 2 chopped, 2 sliced",
        "1 x 340g tin corned beef, roughly chopped",
        "1 tbsp Worcestershire sauce",
        "4-5 drops Tabasco"
    ],
    "ingredients": [
        "vegetable oil",
        "vinegar",
        "plain flour",
        "floury potatoes",
        "Worcestershire sauce",
        "corned beef",
        "Tabasco",
        "lager",
        "garlic",
        "butter",
        "caster sugar",
        "salt",
        "onions",
        "tomatoes"
    ],
    "method": [
        "Bring the potatoes to the boil in a pan of salted water. Reduce the heat until the water is simmering and simmer the potatoes for 8-10 minutes, or until just tender. Drain well and set aside.",
        "Meanwhile, heat the oil in a deep-fat fryer to 190C. Alternatively, heat the oil in a deep, heavy-based saucepan, until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: Hot oil can be dangerous. Do not leave unattended.)",
        "Whisk the flour, sugar, salt, vinegar and half of the beer together in a large bowl to a thick, smooth batter. Continue to add the beer a little at a time until the batter has the consistency of double cream (you may not need to use all of the beer).",
        "Separate the onion slices into rings and dip each one into the batter until completely coated. Carefully lower the onion rings, in batches, into the hot oil and fry for 3-4 minutes, or until golden-brown and cooked through. Remove from the hot oil and set aside to drain on kitchen paper. Repeat the process with the remaining onion rings.",
        "Heat half of the butter in a frying pan over a medium heat and add the chopped onion. Fry for 2-3 minutes, or until softened.",
        "Add the remaining butter to the pan, then add the garlic and drained potatoes and continue to fry for 2-3 minutes.",
        "Add the chopped tomatoes and the corned beef and stir-fry for 1-2 minutes, or until the tomatoes have softened and the corned beef is heated through. Add the Worcestershire sauce and Tabasco and season, to taste, with salt and freshly ground black pepper.",
        "To serve, spoon the corned beef hash onto serving plates. Pile the onion rings on top. Garnish with the sliced tomatoes."
    ]
},
{
    "title": "Spiced pecan pie",
    "description": "Give pecan pie a flavour twist with cloves, cinnamon and star anise.",
    "cuisine": "american",
    "courses": [],
    "diets": [],
    "image": "",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/spiced_pecan_pie_39294",
    "chefName": "Cyrus Todiwala",
    "preparationTime": "30 mins to 1 hour",
    "cookingTime": "30 mins to 1 hour",
    "serves": "Serves 8",
    "ingredientsDesc": [
        "370g/12½oz plain flour, plus extra for dusting",
        "180g/6¼oz salted butter, chopped into small pieces",
        "4 small cloves, finely crushed",
        "pinch ground star anise",
        "8-10 tbsp chilled water",
        "125g/4½oz butter",
        "100g/3½oz golden syrup",
        "100g/3½oz Muscovado or soft brown sugar",
        "3 medium free-range eggs",
        "300g/10½oz pecan nut halves",
        "¼ tsp ground cinnamon",
        "vanilla ice cream or fresh cream"
    ],
    "ingredients": [
        "butter",
        "cloves",
        "plain flour",
        "star anise",
        "eggs",
        "golden syrup",
        "pecan",
        "brown sugar",
        "8-10 tbsp chilled water",
        "cream",
        "cinnamon"
    ],
    "method": [
        "Make the pastry first. Sift the flour into a large bowl, add the butter and rub it in with your fingers until the mixture resembles coarse breadcrumbs. Stir in the cloves and star anise.",
        "Using a spatula, mix in the measured water a bit at a time until a dough forms. Bring it together using your hands. Wrap in cling film and refrigerate for 15-20 minutes. Meanwhile, preheat the oven to 180C/160C Fan/Gas 4.",
        "Lightly flour a work surface and roll out the pastry so that it’s large enough to line a 23cm/9in tart tin and overhang the sides by about 2cm/¾in.",
        "Crumple a sheet of baking paper and use it to line the pastry case. Fill with baking beans, uncooked rice or chickpeas. Reduce the oven temperature to 150C/130C Fan/Gas 2 and bake for 8-10 minutes. Set aside to cool slightly, then remove paper and beans.",
        "Increase the oven temperature to 190C/170C Fan/Gas Mark 5.",
        "To make the filling, put the butter, syrup and sugar in a saucepan and heat gently until the sugar dissolves. Remove from the heat. Beat the eggs in a bowl until light and frothy. Gradually pour in the warm sugar mixture, folding it together with a spatula as you do so.",
        "Chop half of the pecans and stir them into the egg mixture along with the cinnamon. Pour into the baked pastry case and arrange the remaining pecan halves on top. Bake in the centre of the oven for 12-15 minutes, until bubbling and golden-brown. Set aside to cool and firm up.",
        "Trim off the excess pastry, then remove the pie from the tin and serve with vanilla ice cream or fresh cream, if you wish."
    ]
},
{
    "title": "Vanilla and bourbon cheesecake",
    "description": "If you want a truly indulgent dessert then look no further than this rich cheesecake topped with chocolate and toffee sauce and caramelised bananas.",
    "cuisine": "american",
    "courses": [],
    "diets": [],
    "image": "",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/vanilla_and_bourbon_20548",
    "chefName": "James Martin",
    "preparationTime": "less than 30 mins",
    "cookingTime": "30 mins to 1 hour",
    "serves": "Serves 6-8",
    "ingredientsDesc": [
        "butter, for greasing",
        "25cm/10in diameter sponge base (cut from a large bought flan case)",
        "200g/7oz caster sugar",
        "3 lemons, finely grated zest only",
        "4 tbsp cornflour",
        "3 tbsp sultanas, soaked in a bit of bourbon",
        "850g/1lb 14oz full fat soft cream cheese",
        "3 medium free-range eggs",
        "1½ tsp vanilla essence",
        "1 vanilla pod, sliced lengthways, seeds removed",
        "whiskey or bourbon, to taste (optional)",
        "375ml/13fl oz cream",
        "10 small bananas",
        "25g/1oz butter",
        "2 tbsp sugar",
        "500ml/18fl oz double cream",
        "175g/6oz unsalted butter",
        "175g/6oz demerara sugar",
        "1 tbsp golden syrup",
        "1 tbsp black treacle",
        "175g/6oz plain chocolate, broken into pieces",
        "50g/1¾oz caster sugar",
        "sprigs of fresh mint"
    ],
    "ingredients": [
        "butter",
        "vanilla essence",
        "cornflour",
        "bananas",
        "chocolate",
        "cream cheese",
        "eggs",
        "25cm/10in diameter sponge base (cut from a large bought flan case)",
        "vanilla pod",
        "whiskey or bourbon, to taste (optional)",
        "golden syrup",
        "black treacle",
        "double cream",
        "lemons",
        "demerara sugar",
        "caster sugar",
        "sugar",
        "mint",
        "sultanas",
        "cream"
    ],
    "method": [
        "Preheat the oven to 180C/160C Fan/Gas 4. Butter a 25cm/10in loose-bottomed cake tin.",
        "Cut the sponge horizontally into 2 discs. Use 1 disc to line the prepared cake tin.",
        "In a bowl mix together the sugar, lemon zest, cornflour and sultanas using a wooden spoon, then beat in the cream cheese. Add the eggs one by one, then add the vanilla essence, beating constantly until all the eggs are well incorporated.",
        "Add the vanilla seeds and a generous splash of whisky or bourbon (about 4 tablespoons), if using. Add the cream and beat well until the mixture is smooth. Pour gently over the sponge base in the cake tin.",
        "Sit the tin in a deep baking tray filled with 2-3mm of warm water to help create steam during cooking. Bake for 50 minutes until the top is golden. Remove and leave to cool and set completely before removing from the tin.",
        "For the bananas, just before serving, peel the bananas and pan fry in the butter and sugar until brown and slightly caramelised.",
        "For the toffee sauce, in a pan set over a low heat combine the cream, butter and sugar. When the butter and sugar have melted, whisk in the syrup and treacle.",
        "For the chocolate sauce, melt the chocolate in a bowl set over a pan of simmering water (make sure the bottom of the bowl does not touch the water).",
        "Heat the sugar in a pan with 100ml/3½fl oz water, stirring until the sugar dissolves. Bring to the boil. Stir the sugar syrup into the melted chocolate until smooth and shiny.",
        "Cut the cheesecake into wedges and serve with the bananas and the toffee and chocolate sauce. Garnish with fresh mint."
    ]
},
{
    "title": "Southern-fried chicken and coleslaw",
    "description": "Marinating overnight in buttermilk is the secret to juicy, succulent chicken pieces. Try it in hot, peppery batter with crunchy coleslaw.",
    "cuisine": "american",
    "courses": [],
    "diets": [],
    "image": "images/southernfriedchicken_83647_16x9.jpg",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/southernfriedchicken_83647",
    "chefName": "Antony Worrall Thompson",
    "preparationTime": "overnight",
    "cookingTime": "10 to 30 mins",
    "serves": "Serves 4",
    "ingredientsDesc": [
        "600ml/1 pint buttermilk",
        "6  tbsp coriander, chopped",
        "6 garlic cloves, finely chopped",
        "2 shallots, finely chopped",
        "½ tsp dried chilli flakes",
        "1 tbsp salt",
        "4 chicken thighs, skinless",
        "6 tbsp plain flour",
        "½ tsp celery salt",
        "½ tsp cayenne pepper",
        "½ tsp ground black pepper",
        "½ tsp paprika",
        "200ml vegetable oil",
        "¼ red cabbage, finely shredded",
        "¼ white cabbage, finely shredded",
        "3 carrots, shredded",
        "4 spring onions, chopped",
        "1 tbsp caraway seeds",
        "1 tbsp chilli sauce",
        "100g/4oz mayonnaise",
        "salt and freshly ground black pepper"
    ],
    "ingredients": [
        "coriander",
        "vegetable oil",
        "plain flour",
        "white cabbage",
        "carrots",
        "spring onions",
        "chilli sauce",
        "cayenne pepper",
        "celery",
        "buttermilk",
        "chicken thighs",
        "black pepper",
        "garlic",
        "paprika",
        "shallots",
        "red cabbage",
        "mayonnaise",
        "dried chilli",
        "salt",
        "caraway seeds"
    ],
    "method": [
        "For the marinade, combine all the ingredients for the marinade and coat the chicken in a shallow dish. Cover and leave to marinate overnight in the fridge.",
        "Combine all the ingredients for the coating. Remove the chicken from the marinade and dip into the spiced flour. Coat thoroughly and return to the fridge for a further 45 minutes.",
        "Preheat the oven to 200C/400F/Gas 6.",
        "Heat the vegetable oil to in a deep heavy-bottomed saucepan, until a breadcrumb sizzles and browns when dropped in it. (CAUTION: hot oil can be dangerous - do not leave unattended!). Add the chicken and fry until golden all over. Remove and place on a baking sheet.",
        "Transfer to the oven and cook for 15-20 minutes until cooked through.",
        "For the coleslaw, mix all of the ingredients together and season to taste."
    ]
},
{
    "title": "Sweet potato gumbo with cornbread muffins",
    "description": "A vegetarian take on the gumbo that combines authentic okra with trendy sweet potato. Serve with sweet cornbread muffins.",
    "cuisine": "american",
    "courses": [],
    "diets": [],
    "image": "images/sweetpotatogumbowith_91317_16x9.jpg",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/sweetpotatogumbowith_91317",
    "chefName": "Simon Rimmer",
    "preparationTime": "less than 30 mins",
    "cookingTime": "30 mins to 1 hour",
    "serves": "Serves 6",
    "ingredientsDesc": [
        "225g/8oz polenta",
        "2 tsp baking powder",
        "pinch bicarbonate of soda",
        "115g/4oz plain flour",
        "125ml/4½fl oz milk",
        "2 free-range eggs, beaten",
        "300g/10½oz canned creamed corn",
        "2 birds'-eye chillies, finely chopped",
        "2 tbsp vegetable oil",
        "1 red onion, peeled, finely chopped",
        "2 celery stalks, trimmed, finely chopped",
        "2 red chillies, finely chopped",
        "2 garlic cloves, peeled, finely chopped",
        "1 tsp salt",
        "1 tsp dried thyme",
        "1 tsp cayenne pepper",
        "1 tsp dried oregano",
        "1 tsp white pepper",
        "1 bay leaf",
        "150ml/5½fl oz vegetable stock",
        "440g/1lb canned chopped tomatoes",
        "24 ladies' fingers (okra)",
        "400g/14oz sweet potato, peeled, cut into cubes",
        "100g/3½oz cabbage, very finely shredded",
        "100g/3½oz butter, to serve"
    ],
    "ingredients": [
        "vegetable oil",
        "bay leaf",
        "red onion",
        "oregano",
        "milk",
        "baking powder",
        "chopped tomatoes",
        "bicarbonate of soda",
        "2 birds'-eye chillies, finely chopped",
        "cayenne pepper",
        "celery",
        "polenta",
        "white pepper",
        "eggs",
        "chillies",
        "garlic",
        "cabbage",
        "okra",
        "butter",
        "plain flour",
        "thyme",
        "300g/10½oz canned creamed corn",
        "vegetable stock",
        "sweet potato",
        "salt"
    ],
    "method": [
        "For the cornbread muffins, preheat the oven to 180C/350F/Gas 4.",
        "In a bowl, mix together the polenta, baking powder, bicarbonate of soda and flour until well combined.",
        "Add the milk, beaten eggs and creamed corn and mix until well combined. Add the chillies and stir to combine.",
        "Spoon the cornbread batter mixture into the wells of a 12-hole muffin tin. Bake in the oven for 18-20 minutes, or until risen and cooked through.",
        "Meanwhile, for the sweet potato gumbo, heat the oil in a pan over a medium heat. Add the onion, celery, chillies and garlic and fry for 4-5 minutes, or until softened.",
        "Mix together the salt, dried thyme, cayenne pepper, dried oregano, white pepper and bay leaf until well combined. Add to the pan and stir well to coat the vegetables. Continue to fry for 2-3 minutes, stirring regularly, until the spices are fragrant.",
        "Add the beef or vegetable stock, chopped tomatoes, and okra and bring the mixture to the boil.",
        "Add the sweet potato cubes and shredded cabbage and continue to cook for 12-15 minutes, or until the sweet potato is tender.",
        "To serve, spoon the gumbo into the centre of each of six serving plates. Butter the cornbread muffins and place one or two alongside each serving."
    ]
},
{
    "title": "Fluffy American pancakes",
    "description": "These pancakes are light and fluffy and great for a weekend brunch. Try adding a large handful of fresh blueberries to the batter before cooking.Read our guide to supercharging your pancakes.",
    "cuisine": "american",
    "courses": [],
    "diets": [],
    "image": "images/fluffyamericanpancak_74828_16x9.jpg",
    "sourceUrl": "https://www.bbc.co.uk/food/recipes/fluffyamericanpancak_74828",
    "chefName": "Louisa Carter",
    "preparationTime": "less than 30 mins",
    "cookingTime": "less than 10 mins",
    "serves": "Serves 4-6",
    "ingredientsDesc": [
        "135g/4¾oz plain flour",
        "1 tsp baking powder",
        "½ tsp salt",
        "2 tbsp caster sugar",
        "130ml/4½fl oz milk",
        "1 large egg, lightly beaten",
        "2 tbsp melted butter (allowed to cool slightly) or olive oil, plus extra for cooking",
        "Maple syrup",
        "Butter"
    ],
    "ingredients": [
        "butter",
        "Maple syrup",
        "plain flour",
        "salt",
        "baking powder",
        "caster sugar",
        "egg",
        "milk",
        "Butter"
    ],
    "method": [
        "Sift the flour, baking powder, salt and caster sugar into a large bowl. In a separate bowl or jug, lightly whisk together the milk and egg, then whisk in the melted butter.",
        "Pour the milk mixture into the flour mixture and, using a fork, beat until you have a smooth batter. Any lumps will soon disappear with a little mixing. Let the batter stand for a few minutes.",
        "Heat a non-stick frying pan over a medium heat and add a knob of butter. When it's melted, add a ladle of batter (or two if your frying pan is big enough to cook two pancakes at the same time). It will seem very thick but this is how it should be. Wait until the top of the pancake begins to bubble, then turn it over and cook until both sides are golden brown and the pancake has risen to about 1cm (½in) thick.",
        "Repeat until all the batter is used up. You can keep the pancakes warm in a low oven, but they taste best fresh out the pan.",
        "Serve with lashings of real maple syrup and extra butter if you like."
    ]
}
]
